{"id":123,"date":"2022-06-22T15:12:04","date_gmt":"2022-06-22T15:12:04","guid":{"rendered":"https:\/\/pinetwork.wpengine.com\/?page_id=123"},"modified":"2023-07-17T10:35:32","modified_gmt":"2023-07-17T17:35:32","slug":"white-paper","status":"publish","type":"page","link":"https:\/\/minepi.com\/white-paper\/","title":{"rendered":"Pi Whitepaper"},"content":{"rendered":"\n<p style=\"text-align: center;\"><em>The December 2021 Whitepaper chapters &#8220;Token Model and Mining&#8221; and &#8220;Roadmap&#8221; were released as an addendum to the original 2019 Whitepaper, with new information on Mainnet. The original March 2019 Whitepaper may need updates to its content, so please refer to the latest Pi Network <a href=\"https:\/\/minepi.com\/safety\">communications<\/a> for up-to-date information. Both Whitepapers are subject to change based on data collected during the Enclosed Network period of Mainnet.<\/em><\/p>\n scl-shortcode-cleaner-clean-content-end-->As the world becomes increasingly digital, cryptocurrency is a next natural step in the evolution of money. Pi is the first digital currency for everyday people, representing a major step forward in the adoption of cryptocurrency worldwide.<\/p>\n<p style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"font-size: 11pt; font-family: Arial; color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><b><strong>Our Mission<\/strong><\/b>: Build a cryptocurrency and smart contracts platform secured and operated by everyday people.<\/span><\/p>\n<p style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"font-size: 11pt; font-family: Arial; color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><b><strong>Our Vision<\/strong><\/b>: Build the world’s most inclusive peer-to-peer ecosystem and online experience, fueled by Pi, the world’s most widely used cryptocurrency.<\/span><\/p>\n<p><em>DISCLAIMER for more advanced readers: Because Pi’s mission is to be inclusive as possible, we’re going to take this opportunity to introduce our blockchain newbies to the rabbit hole 🙂<\/em><\/p>\n<h2>Introduction: Why cryptocurrencies matter<\/h2>\n<p>Currently, our everyday financial transactions rely upon a trusted third party to maintain a record of transactions. For example, when you do a bank transaction, the banking system keeps a record &amp; guarantees that the transaction is safe &amp; reliable. Likewise, when Cindy transfers $5 to Steve using PayPal, PayPal maintains a central record of $5 dollars debited from Cindy’s account and $5 credited to Steve’s. Intermediaries like banks, PayPal, and other members of the current economic system play an important role in regulating the world’s financial transactions.<\/p>\n<p>However, the role of these trusted intermediaries also has limitations:<\/p>\n<ol>\n<li>Unfair value capture. These intermediaries amass billions of dollars in wealth creation (PayPal market cap is ~$130B), but pass virtually nothing onto their customers &#8211; the everyday people on the ground, whose money drives a meaningful proportion of the global economy. More and more people are falling behind.<\/li>\n<li>Fees. Banks and companies charge large fees for facilitating transactions. These fees often disproportionately impact lower-income populations who have the fewest alternatives.<\/li>\n<li>Censorship. If a particularly trusted intermediary decides that you should not be able to move your money, it can place restrictions on the movement of your money.<\/li>\n<li>Permissioned. The trusted intermediary serves as a gatekeeper who can arbitrarily prevent anybody from being part of the network.<\/li>\n<li>Pseudonymous. At a time when the issue of privacy is gaining greater urgency, these powerful gatekeepers can accidentally disclose &#8212; or force you to disclose &#8212; more financial information about yourself than you may want.<\/li>\n<\/ol>\n<p>Bitcoin’s “peer-to-peer electronic cash system,” launched in 2009 by an anonymous programmer (or group) Satoshi Nakamoto, was a watershed moment for the freedom of money. For the first time in history, people could securely exchange value, without requiring a third party or trusted intermediary. Paying in Bitcoin meant that people like Steve and Cindy could pay each other directly, bypassing institutional fees, obstructions, and intrusions. Bitcoin was truly a currency without boundaries, powering and connecting a new global economy.<\/p>\n<h3>Introduction To Distributed Ledgers<\/h3>\n<p>Bitcoin achieved this historical feat by using a distributed record. While the current financial system relies on the traditional central record of truth, the Bitcoin record is maintained by a distributed community of “validators,” who access and update this public ledger. Imagine the Bitcoin protocol as a globally shared “Google Sheet” that contains a record of transactions, validated and maintained by this distributed community.<\/p>\n<p>The breakthrough of Bitcoin (and general blockchain technology) is that, even though the record is maintained by a community, the technology enables them to always reach consensus on truthful transactions, insuring that cheaters cannot record false transactions or overtake the system. This technological advancement allows for the removal of the centralized intermediary, without compromising transactional financial security.<\/p>\n<h3>Benefits Of Distributed Ledgers<\/h3>\n<p>In addition to decentralization, bitcoin, or cryptocurrencies in general, share a few nice properties that make money smarter and safer, although different cryptocurrencies may be stronger in some properties and weaker in others, based on different implementations of their protocols. Cryptocurrencies are held in cryptographic wallets identified by a publicly accessible address, and is secured by a very strong privately held password, called the private key. This private key cryptographically signs transactions and is virtually impossible to create fraudulent signatures. This provides security and unseizability. Unlike traditional bank accounts that can be seized by government authorities, the cryptocurrency in your wallet can never be taken away by anyone without your private key. Cryptocurrencies are censorship-resistant due to the decentralized nature because anyone can submit transactions to any computer in the network to get recorded and validated. Cryptocurrency transactions are immutable because each block of transactions represents a cryptographic proof (a hash) of all the previous blocks that existed before that. Once someone sends you money, they cannot steal back their payment to you (i.e., no bouncing checks in blockchain). Some of the cryptocurrencies can even support atomic transactions. “Smart contracts” built atop these cryptocurrencies do not merely rely on law for enforcement, but directly enforced through publicly auditable code, which make them trustless and can potentially get rid of middlemen in many businesses, e.g. Escrow for real estate.<\/p>\n<h3>Securing Distributed Ledgers (Mining)<\/h3>\n<p>One of the challenges of maintaining a distributed record of transactions is security &#8212; specifically, how to have an open and editable ledger while preventing fraudulent activity. To address this challenge, Bitcoin introduced a novel process called Mining (using the consensus algorithm “Proof of Work”) to determine who is “trusted” to make updates to the shared record of transactions.<\/p>\n<p>You can think of the mining as a type of economic game that forces “Validators” to prove their merit when trying to add transactions to the record. To qualify, Validators must solve a series of complex computational puzzles. The Validator who solves the puzzle first is rewarded by being allowed to post the latest block of transactions. Posting the latest block of transactions allows Validators to “mine” a Block Reward &#8211; currently 12.5 bitcoin (or ~$40,000 at the time of writing).<\/p>\n<p>This process is very secure, but it demands enormous computing power and energy consumption as users essentially “burn money” to solve the computational puzzle that earns them more Bitcoin. The burn-to-reward ratio is so punitive that it is always in Validators’ self-interest to post honest transactions to the Bitcoin record. scl-shortcode-cleaner-clean-content-end-->In the early days of Bitcoin, when only a few people were working to validate transactions and mining the first blocks, anyone could earn 50 BTC by simply running Bitcoin mining software on their personal computer. As the currency began to gain in popularity, clever miners realized that they could earn more if they had more than one computer working to mine.<\/p>\n<p>As Bitcoin continued to increase in value, entire companies began to spring up to mine. These companies developed specialized chips (“ASICs”) and constructed huge farms of servers using these ASIC chips to mine Bitcoin. The emergence of these enormous mining corporations, known drove the Bitcoin Gold Rush, making it very difficult for everyday people to contribute to the network and get rewarded. Their efforts also began consuming increasingly large amounts of computing energy, contributing to mounting environmental issues around the world.<\/p>\n<p>The ease of mining Bitcoin and the subsequent rise of Bitcoin mining farms quickly produced a massive centralization of production power and wealth in Bitcoin’s network. To provide some context, 87% of all Bitcoins are now owned by 1% of their network, many of these coins were mined virtually free in their early days. As another example, Bitmain, one of Bitcoin’s biggest mining operations has earned <a href=\"https:\/\/www.coindesk.com\/markets\/2018\/09\/27\/bitmain-by-the-numbers-an-inside-look-at-a-bitcoin-mining-empire\/\" target=\"_blank\" rel=\"noopener\">billions in revenue and profits<\/a>.<\/p>\n<p>The centralization of power in Bitcoin’s network makes it very difficult and expensive for the average person. If you want to acquire Bitcoin, your easiest options are to:<\/p>\n<ol>\n<li>Mine It Yourself. Just hook up the specialized hardware (here’s a rig on Amazon, if you’re interested!) and go to town. Just know that since you’ll be competing against massive server farms from across the world, consuming as much energy as the country of Switzerland, you won’t be able to mine much<\/li>\n<li>Buy Bitcoin on an exchange. Today, you can buy Bitcoin at a unit price of $3,500 \/ coin at the time of writing (note: you can buy the fractional amount of Bitcoin!) Of course, you would also be taking on substantial risk in doing so as the price of Bitcoin is quite volatile.<\/li>\n<\/ol>\n<p>Bitcoin was the first to show how cryptocurrency could disrupt the current financial model, giving people the ability to make transactions without having a third party in the way. The increase in freedom, flexibility, and privacy continues to drive the inevitable march toward digital currencies as a new norm. Despite its benefits, Bitcoin’s (likely unintended) concentration of money and power present a meaningful barrier to mainstream adoption. As Pi’s core team has conducted research to try to understand why people are reluctant to enter the cryptocurrency space. People consistently cited the risk of investing\/mining as a key barrier to entry. scl-shortcode-cleaner-clean-content-end-->After identifying these key barriers to adoption, the Pi Core Team set out to find a way that would allow everyday people to mine (or earn cryptocurrency rewards for validating transactions on a distributed record of transactions). As a refresher, one of the major challenges that arises with maintaining a distributed record of transactions is ensuring that updates to this open record are not fraudulent. While Bitcoin’s process for updating its record is proven (burning energy \/ money to prove trustworthiness), it is not very user (or planet!) friendly. For Pi, we introduced the additional design requirement of employing a consensus algorithm that would also be extremely user friendly and ideally enable mining on personal computers and mobile phones.<\/p>\n<p>In comparing existing consensus algorithms (the process that records transactions into a distributed ledger), the Stellar Consensus Protocol emerges as the leading candidate to enable user-friendly, mobile-first mining. <a href=\"https:\/\/www.stellar.org\/papers\/stellar-consensus-protocol.pdf\" target=\"_blank\" rel=\"noopener\">Stellar Consensus Protocol<\/a>(SCP) was architected by David Mazières a professor of Computer Science at Stanford who also serves as Chief Scientist at the <a href=\"https:\/\/www.stellar.org\/about\/\" target=\"_blank\" rel=\"noopener\">Stellar Development Foundation<\/a>. SCP uses a novel mechanism called Federated Byzantine Agreements to ensure that updates to a distributed ledger are accurate and trustworthy. SCP is also deployed in practice through the Stellar blockchain that has been operating since <a href=\"https:\/\/stellar.expert\/explorer\/public\/ledger\/3\">2015<\/a>.<\/p>\n<h3>A Simplified Introduction To Consensus Algorithms<\/h3>\n<p>Before jumping to introducing the Pi consensus algorithm, it helps to have a simple explanation on what a consensus algorithm does for a blockchain and the types of consensus algorithms that today’s blockchain protocols generally use, e.g. Bitcoin and SCP. This section is explicitly written in a oversimplified manner for the sake of clarity, and is not complete. For higher accuracy, see the section Adaptations to SCP below and read the stellar consensus protocol paper.<\/p>\n<p>A blockchain is a fault-tolerant distributed system that aims to totally order a list of blocks of transactions. Fault-tolerant distributed systems is an area of computer science that has been studied for many decades. They are called distributed systems because they do not have a centralized server but instead they are composed of a decentralized list of computers (called nodes or peers) that need to come to a consensus as to what is the content and total ordering of blocks. They are also called fault-tolerant because they can tolerate a certain degree of faulty nodes into the system (e.g. up to 33% of nodes can be faulty and the overall system continues to operate normally).<\/p>\n<p>There are two broad categories of consensus algorithms: The ones that elect a node as the leader who produces the next block, and the ones where there is no explicit leader but all nodes come to a consensus of what the next block is after exchanging votes by sending computer messages to each other. (Strictly speaking the last sentence contains multiple inaccuracies, but it helps us explain the broad strokes.)<\/p>\n<p>Bitcoin uses the first type of consensus algorithm: All bitcoin nodes are competing against each other in solving a cryptographic puzzle. Because the solution is found randomly, essentially the node that finds the solution first, by chance, is elected the leader of the round who produces the next block. This algorithm is called “Proof of work” and results in a lot of energy consumption.<\/p>\n<h3>A Simplified Introduction To Stellar Consensus Protocol<\/h3>\n<p>Pi uses the other type of consensus algorithms and is based on the Stellar Consensus Protocol (SCP) and an algorithm called Federated Byzantine Agreement (FBA). Such algorithms don’t have energy waste but they require exchanging many network messages in order for the nodes to come to “consensus” on what the next block should be. Each node can independently determine if a transaction is valid or not, e.g. authority of making the transition and double spending, based on the cryptographic signature and the transaction history. However, for a network of computers to agree on which transactions to record in a block and the order of these transactions and blocks, they need to message each other and have multiple rounds of voting to come to consensus. Intuitively, such messages from different computers in the network about which block is the next would look like the following: “I propose we all vote for block A to be next”; “I vote for block A to be the next block”; “I confirm that the majority of the nodes I trust also voted for block A”, from which the consensus algorithm enables this node to conclude that “A is the next block; and there could be no block other than A as the next block”;  Even though the above voting steps seem a lot, the internet is adequately fast and these messages are lightweight, thus such consensus algorithms are more lightweight than Bitcoin’s proof of work. One major representative of such algorithms is called Byzantine Fault Tolerance (BFT). Several of the top blockchains today are based on variants of BFT, such as NEO and Ripple.<\/p>\n<p>One major criticism of BFT is that it has a centralization point: because voting is involved, the set of nodes participating in the voting “quorum” are centrally determined by the creator of the system in its beginning. The contribution of FBA is that, instead of having one centrally determined quorum, each node sets their own “quorum slices”, which will in turn form different quorums. New nodes can join the network in a decentralized way: they declare the nodes that they trust and convince other nodes to trust them, but they don’t have to convince any central authority.<\/p>\n<p>SCP is one instantiation of FBA. Instead of burning energy like in Bitcoin’s proof of work consensus algorithm, SCP nodes secure the shared record by vouching for other nodes in the network as trustworthy. Each node in the network builds a quorum slice, consisting of other nodes in the network that they deem to be trustworthy. Quorums are formed based on its members quorum slices, and a validator will only accept new transactions if and only if a proportion of nodes in their quorums will also accept the transaction. As validators across the network construct their quorums, these quorums help nodes to reach consensus about transactions with guarantee on security. You can learn more about the Stellar Consensus Protocol by checking out this <a href=\"https:\/\/medium.com\/stellar-development-foundation\/on-worldwide-consensus-359e9eb3e949\" target=\"_blank\" rel=\"noopener\">technical summary of SCP<\/a>.<\/p>\n<h2>Pi’s Adaptations to Stellar Consensus Protocol (SCP)<\/h2>\n<p>Pi’s consensus algorithm builds atop SCP.  SCP has been formally proven  and is currently implemented within the Stellar Network. Unlike Stellar Network consisting mostly of companies and institutions (e.g., IBM) as nodes, Pi intends to allow devices of individuals to contribute on the protocol level and get rewarded, including mobile phones, laptops and computers. Below is an introduction on how Pi applies SCP to enabling mining by individuals.<\/p>\n<p>There are four roles Pi users can play, as Pi miners. Namely:<\/p>\n<ul>\n<li>Pioneer. A user of the Pi mobile app who is simply confirming that they are not a “robot” on a daily basis. This user validates their presence every time they sign in to the app. They can also open the app to request transactions (e.g. make a payment in Pi to another Pioneer)<\/li>\n<li>Contributor. A user of the Pi mobile app who is contributing by providing a list of pioneers he or she knows and trusts. In aggregate, Pi contributors will build a global trust graph.<\/li>\n<li>Ambassador. A user of the Pi mobile app who is introducing other users into Pi network.<\/li>\n<li>Node. A user who is a pioneer, a contributor using the Pi mobile app, and is also running the Pi node software on their desktop or laptop computer. The Pi node software is the software that runs the core SCP algorithm, taking into account the trust graph information provided by the Contributors.<\/li>\n<\/ul>\n<p>A user can play more than one of the above roles. All roles are necessary, thus all roles are rewarded with newly minted Pi on a daily basis as long as they participated and contributed during that given day. In the loose definition of a “miner” being a user who receives newly minted currency as a reward for contributions, all four roles are considered to be Pi miners. We define“mining” more broadly than its traditional meaning equated to executing proof of work consensus algorithm as in Bitcoin or Ethereum.<\/p>\n<p>First of all, we need to emphasize that the Pi Node software has not been released yet. So this section is offered more as an architectural design and as a request to solicit comments from the technical community. This software will be fully open source and it will also heavily depend on stellar-core which is also open source software, available <a href=\"https:\/\/github.com\/stellar\/stellar-core\">here<\/a>. This means that anyone in the community will be able to read, comment and propose improvements on it. Below are the Pi proposed changes to SCP to enable mining by individual devices.<\/p>\n<p>Nodes<\/p>\n<p>For readability, we define as a correctly connected node to be what the SCP paper refers to as an intact node. Also, for readability, we define as the main Pi network to be the set of all intact nodes in the Pi network. The main task of each Node is to be configured to be correctly connected to the main Pi network. Intuitively, a node being incorrectly connected to the main network is similar to a Bitcoin node not being connected to the main bitcoin network.<\/p>\n<p>In SCP’s terms, for a node to get correctly connected means that this node must chose a “quorum slice” such that all resulting quorums that include this node intersect with the existing network’s quorums. More precisely, a node vn+1 is correctly connected to a main network N of n already correctly connected nodes (v1, v2, …, vn) if the resulting system N’ of n+1 nodes (v1, v2, …, vn+1) enjoys quorum intersection. In other words, N’ enjoys quorum intersection iff any two of its quorums share a node. &#8212; i.e., for all quorums U1 and U2, U1∩U2 ≠ ∅.<\/p>\n<p>The main contribution of Pi over the existing Stellar consensus deployment is that it introduces the concept of a trust graph provided by the Pi Contributors as information that can be used by the Pi nodes when they are setting up their configurations to connect to the main Pi network.<\/p>\n<p>When picking their quorum slices, these Nodes must take into consideration the trust graph provided by the Contributors, including their own security circle. To assist in this decision, we intend to provide auxiliary graph analysis software to assist users running Nodes to make as informed decisions as possible. This software’s daily output will include:<\/p>\n<ul>\n<li>a ranked list of nodes ordered by their distance from the current node in the trust graph; a ranked list of nodes based a <a href=\"https:\/\/en.wikipedia.org\/wiki\/PageRank\" target=\"_blank\" rel=\"noopener\">pagerank<\/a> analysis of nodes in the trust graph<\/li>\n<li>a list of nodes reported by the community as faulty in any way a list of new nodes seeking to join the network<\/li>\n<li>a list of most recent articles from the web on the keyword “misbehaving Pi nodes” and other related keywords; a visual representation of Nodes comprising the Pi network similar to what is shown in <a href=\"https:\/\/stellarbeat.io\/quorum-monitor\/\" target=\"_blank\" rel=\"noopener\">StellarBeat Quorum monitor<\/a> <\/li>\n<li>a quorum explorer similar to <a href=\"https:\/\/www.quorumexplorer.com\/\" target=\"_blank\" rel=\"noopener\">QuorumExplorer.com<\/a> <\/li>\n<li>a simulation tool like the one in <a href=\"https:\/\/stellarbeat.io\/quorum-monitor\/\" target=\"_blank\" rel=\"noopener\">StellarBeat Quorum monitor<\/a> that shows the expected resulting impacts to this nodes’ connectivity to the Pi network when the current node’s configuration changes.<\/li>\n<\/ul>\n<p>An interesting research problem for future work is to develop algorithms that can take into consideration the trust graph and suggest each node an optimal configuration, or even set that configuration automatically. On the first deployment of the Pi Network, while users running Nodes can update their Node configuration at any time, they will be prompted to confirm their configurations daily and asked to update them if they see fit.<\/p>\n<p>Mobile app users<\/p>\n<p>When a Pioneer needs to confirm that a given transaction has been executed (e.g. that they have received Pi) they open the mobile app. At that point, the mobile app connects to one or more Nodes to inquire if the transaction has been recorded on the ledger and also to get the most recent block number and hash value of that block. If that Pioneer is also running a Node the mobile app connects to that Pioneer’s own node. If the Pioneer is not running a node, then the app connects to multiple nodes and to cross check this information. Pioneers will have the ability select which nodes they want their apps to connect to. But to make it simple for most users, the app should have a reasonable default set of nodes, e.g. a number of nodes closest to the user based on the trust graph, along with a random selection of nodes high in pagerank. We ask for your feedback on how the default set of nodes for mobile Pioneers should be selected.<\/p>\n<p>Mining rewards<\/p>\n<p>A beautiful property of the SCP algorithm is that it is more generic than a blockchain. It coordinates consensus across a distributed system of Nodes. This means that the same core algorithm is not only used every few seconds to record new transactions in new blocks, but also it can be used to periodically run more complex computations. For example, once a week, the stellar network is using it to compute inflation on the stellar network and allocate the newly minted tokens proportionally to all stellar coin holders (Stellar’s coin is called lumens). In a similar manner, the Pi network employs SCP once a day to compute the network-wide new Pi distribution across all Pi miners (pioneers, contributors, ambassadors, nodes) who actively participated in any given day. In other words, Pi mining rewards are computed only once daily and not on every block of the blockchain.<\/p>\n<p>For comparison Bitcoin allocates mining rewards on every block and it give all of the reward to the miner who was lucky enough to be able to solve a computationally intensive randomized task. This reward in Bitcoin currently 12.5 Bitcoin (~$40K) is given to only one miner every 10 minutes. This makes it extremely unlikely for any given miner to ever get rewards. As a solution to that, bitcoin miners are getting organized in centralized mining pools, which all contribute processing power, increasing the likelihood of getting rewards, and eventually sharing proportionally those rewards. Mining pools are not only points of centralization, but also their operators get cuts reducing the amount going to individual miners.  In Pi, there is no need for mining pools, since once a day everyone who contributed get a meritocratic distribution of new Pi.<\/p>\n<p>Transaction fees<\/p>\n<p>Similar to Bitcoin transactions, fees are optional in the Pi network. Each block has a certain limit of how many transactions can be included in it. When there is no backlog of transactions, transactions tend to be free. But if there are more transactions, nodes order them by fee, with highest-fee-transactions at the top and pick only the top transactions to be included in the produced blocks. This makes it an open market. Implementation: Fees are proportionally split among Nodes once a day. On every block, the fee of each transaction is transferred into a temporary wallet from where in the end of the day it is distributed to the active miners of the day. This wallet has an unknown private key. Transactions in and out of that wallet are forced by the protocol itself under the consensus of all nodes in the same way the consensus also mints new Pi every day.<\/p>\n<p>Limitations and future work<\/p>\n<p>SCP has been extensively tested for several years as part of the Stellar Network, which at the time of this writing is the ninth largest cryptocurrency in the world. This gives us a quite large degree of confidence in it. One ambition of the Pi project is to scale the number of nodes in the Pi network to be larger than the number of nodes in the Stellar network to allow more everyday users to participate in the core consensus algorithm. Increasing the number of nodes, will inevitably increase the number of network messages that must be exchanged between them. Even though these messages are much smaller than an image or a youtube video, and the Internet today can reliably transfer videos quickly, the number of messages necessary increases with the number of participating nodes, which can become bottleneck to the speed of reaching consensus. This will ultimately slow down the rate, at which new blocks and new transactions are recorded in the network. Thankfully, Stellar is currently much faster than Bitcoin. At the moment, Stellar is calibrated to produce a new block every 3 to 5 seconds, being able to support thousands of transactions per second. By comparison, Bitcoin produces a new block every 10 minutes. Moreover, due to Bitcoin’s lack in the safety guarantee, Bitcoin’s blockchain in rare occasions can be overwritten within the first hour. This means that a user of Bitcoin must wait about 1 hour before they can be sure that a transaction is considered final. SCP guarantees safety, which means after 3-5 seconds one is certain about a transaction. So even with the potential scalability bottleneck,  Pi expects to achieve transaction finality faster than Bitcoin and possibly slower than Stellar, and process more transactions per second than Bitcoin and possibly fewer than Stellar.<\/p>\n<p>While scalability of SCP is still an open research problem. There are multiple promising ways one could speed things up. One possible scalability solution is <a href=\"https:\/\/bloxroute.com\/\" target=\"_blank\" rel=\"noopener\">bloXroute<\/a>. BloXroute proposes a blockchain distribution network (BDN) that utilizes a global network of servers optimized for network performance. While each BDN is centrally controlled by one organization, they offer a provably neutral message passing acceleration. I.e. BDNs can only serve all nodes fairly without discrimination as messages are encrypted. This means the BDN does not know where messages come from, where they go, or what is inside. This way Pi nodes can have two message passing routes: A fast one through BDN, which is expected to be reliable most of the time, and its original peer-to-peer message passing interface that is fully decentralized and reliable but is slower. The intuition of this idea is vaguely similar to caching: The cache is place where a computer can access data very quickly, speeding the average computation, but it is not guaranteed to always have every needed piece of information. When the cache misses, the computer is slowed down but nothing catastrophic happens. Another solution can be using secure acknowledgment of multicast messages in open Peer-to-Peer networks  to speed up message propagation among peers. scl-shortcode-cleaner-clean-content-end-->One of Bitcoin’s most impressive innovations is its marriage of distributed systems with economic game theory.<\/p>\n<h3>Pros<\/h3>\n<h3>Fixed Supply<\/h3>\n<p>Bitcoin’s economic model is simple. There will only ever be 21 million Bitcoin in existence. This number is set in code. With only 21M to circulate among 7.5B people around the world, there is not enough Bitcoin to go around. This scarcity is one of most important drivers of Bitcoin’s value.<\/p>\n<h3>Decreasing Block Reward<\/h3>\n<p>Bitcoin’ distribution scheme, pictured below, further enforces this sense of scarcity. The Bitcoin block mining reward halves every 210,000 blocks (approximately every ~4 years.) In its early days, the Bitcoin block reward was 50 coins. Now, the reward is 12.5, and will further decrease to 6.25 coins in May 2020. Bitcoin’s decreasing rate of distribution means that, even as awareness of the currency grows, there is less to actually mine.<\/p>\n<h3>Cons<\/h3>\n<h3>Inverted Means Uneven<\/h3>\n<p>Bitcoin’s inverted distribution model (less people mining more in the beginning, and more people mine less today) is one of the primary contributors to its uneven distribution. With so much Bitcoin in the hands of a few early adopters, new miners are “burning” more energy for less bitcoin.<\/p>\n<h3>Hoarding Inhibits Use As A Medium Of Exchange<\/h3>\n<p>Although Bitcoin was released as a “peer to peer electronic cash” system, the relative scarcity of Bitcoin has impeded Bitcoin’s goal of serving as a medium exchange. Bitcoin’s scarcity has led to its perception as a form of “digital gold” or a digital store of value. The result of this perception is that many Bitcoin holders are unwilling to spend Bitcoin on day-to-day expenses.<\/p>\n<h2>The Pi Economic Model<\/h2>\n<p>Pi, on the other hand, seeks to strike a balance between creating a sense of scarcity for Pi, while still ensuring that a large amount does not accumulate into a very small number of hands. We want to make sure our users mine more Pi as they make contributions to the network. Pi’s goal is to build an economic model that is sophisticated enough to achieve and balance these priorities while remaining intuitive enough for people to use.<\/p>\n<p>Pi’s economic model design requirements:<\/p>\n<ul>\n<li>Simple: Build an intuitive and transparent model<\/li>\n<li>Fair distribution: Give a critical mass of the world’s population access to Pi<\/li>\n<li>Scarcity: Create a sense of scarcity to sustain Pi’s price over time<\/li>\n<li>Meritocratic mining: Reward contributions to build and sustain the network<\/li>\n<\/ul>\n<h3>Pi &#8211; Token Supply<\/h3>\n<h4>Token Emission Policy<\/h4>\n<ol>\n<li>Total Max Supply = M + R + D\n<ol>\n<li>M = total mining rewards<\/li>\n<li>R = total referral rewards<\/li>\n<li>D = total developer rewards<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<ol>\n<li>M = ∫ f(P) dx where f is a logarithmically declining function\n<ol>\n<li>P = Population number (e.g., 1st person to join, 2nd person to join, etc.)<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<ol>\n<li>R = r * M\n<ol>\n<li>r = referral rate (50% total or 25% for both referrer and referee)<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<ol>\n<li>D = t * (M + R)<\/li>\n<li>t = developer reward rate (25%)<\/li>\n<\/ol>\n<h4>M &#8211; Mining Supply (Based on fixed mining supply minted per person)<\/h4>\n<p>In contrast to Bitcoin which created a fixed supply of coins for the entire global population, Pi creates a fixed supply of Pi for each person that joins the network up to the first 100 Million participants. In other words, for each person that joins the Pi Network, a fixed amount of Pi is pre-minted. This supply is then released over the lifetime of that member based on their level of engagement and contribution to network security. The supply is released using an exponentially decreasing function similar to Bitcoin’s over the member’s lifetime.<\/p>\n<h4>R &#8211; Referral Supply (Based on fixed referral reward minted per person and shared b\/w referrer and referee)<\/h4>\n<p>In order for a currency to have value, it must be widely distributed. To incentivize this goal, the protocol also generates a fixed amount of Pi that serves as a referral bonus for both the referrer and the referee (or both parent and offspring 🙂 This shared pool can be mined by both parties over their lifetime &#8211; when both parties are actively mining. Both referrer and referee are able to draw upon this pool in order to avoid exploitative models where referrers are able to “prey” on their referees. The referral bonus serves as a network-level incentive to grow the Pi Network while also incentivizing engagement among members in actively securing the network.<\/p>\n<h4>D &#8211; Developer Reward Supply (Additional Pi minted to support ongoing development)<\/h4>\n<p>Pi will fund its ongoing development with a “Developer Reward” that is minted alongside each Pi coin that is minted for mining and referrals. Traditionally, cryptocurrency protocols have minted a fixed amount of supply that is immediately placed into treasury. Because Pi’s total supply is dependent on the number of members in the network, Pi progressively mints its developer reward as the network scales. The progressive minting of Pi’s developer reward is meant to align the incentives of Pi’s contributors with the overall health of the network.<\/p>\n<h4>f is a logarithmically decreasing function &#8211; early members mine more<\/h4>\n<p>While Pi seeks to avoid extreme concentrations of wealth, the network also seeks to reward earlier members and their contributions with a relatively larger share of Pi. When networks such as Pi are in their early days, they tend to provide a lower utility to participants. For example, imagine having the very first telephone in the world. It would be a great technological innovation but not extremely useful. However, as more people acquire telephones, each telephone holder gets more utility out of the network. In order to reward people that come to the network early, Pi’s individual mining reward and referral rewards decrease as a function of the number of people in the network. In other words, there is a certain amount of Pi that is reserved for each “slot” in the Pi Network. scl-shortcode-cleaner-clean-content-end-->\n<p dir=\"ltr\">Today, everyone is sitting on a veritable treasure trove of untapped resources. Each of us spend hours day on our phones. While on our phones, each of our views, posts or clicks creates extraordinary profits for large corporations. At Pi, we believe that people have the right to capture value created from their resources.<\/p>\n<p dir=\"ltr\">We all know that we can do more together than we can alone. On today’s web, massive corporations like Google, Amazon, Facebook have immense leverage against individual consumers. As a result, they are able to capture the lionshare of value created by individual consumers on the web. Pi levels the playing field by allowing its members to pool their collective resources so they can get a share of the value that they create.<\/p>\n<p dir=\"ltr\">The graphic below is the Pi Stack, where we see particularly promising opportunities for helping our members capture value. Below, we go into each of these areas in more detail.<\/p>\n<h2 dir=\"ltr\">Introducing the Pi Stack &#8211; Unleashing underutilized resources<\/h2>\n<p><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/pinetwork.wpengine.com\/wp-content\/uploads\/2022\/06\/pasted-image-0-300x231.png\" alt=\"\" width=\"300\" height=\"231\" \/><\/p>\n<div id=\"paragraph_5\" data-wysiwyg-key=\"white-paper_value_5\">\n<h3 dir=\"ltr\">Pi Ledger And Shared Trust Graph &#8211; Scaling Trust Across The Web<\/h3>\n<p dir=\"ltr\">One of the biggest challenges on the internet is knowing who to trust. Today, we rely on the  rating systems of providers such as Amazon, eBay, Yelp, to know who we can transact with on the internet. Despite the fact that we, customers, do the hard work of rating and reviewing our peers, these internet intermediaries capture the lionshare of the value created this work.<\/p>\n<p dir=\"ltr\">Pi’s consensus algorithm, described above, creates a native trust layer that scales trust on the web without intermediaries. While the value of just one individual’s Security Circle is small, the aggregate of our individual security circles build a global “trust graph” that help people understand who on the Pi Network can be trusted. The Pi Network’s global trust graph will facilitate transactions between strangers that would not have otherwise been possible. Pi’s native currency, in turn, allows everyone who contributes to the security of the network to capture a share of the value they have helped create.<\/p>\n<h3 dir=\"ltr\">Pi’s Attention Marketplace &#8211; Bartering Unutilized Attention And Time<\/h3>\n<p dir=\"ltr\">Pi allows its members to pool their collective attention to create an attention market much more valuable than any individual’s attention alone. The first application built on this layer will be a scarce social media channel currently hosted on the home screen of the application. You can think of the scarce social media channel as Instagram with one global post at a time. Pioneers can wager Pi to engage the attention of other members of the network, by sharing content (e.g., text, images, videos) or asking questions that seek to tap into the collective wisdom of the community. On the Pi Network, everyone has the opportunity to be an influencer or to tap into the wisdom of the crowd. To date, Pi’s Core Team has been using this channel to poll the community’s opinion on design choices for Pi (e.g. the community voted on the design and colors of the Pi logo.) We have received many valuable responses and feedback from the community on the project. One possible future direction is to open the attention market for any Pioneer to use Pi to post their content, while expanding the number of channels hosted on the Pi Network.<\/p>\n<p dir=\"ltr\">In addition to bartering attention with their peers, Pioneers may also opt into bartering with companies that are seeking their attention. The average American sees between <a href=\"https:\/\/www.forbes.com\/sites\/forbesagencycouncil\/2017\/08\/25\/finding-brand-success-in-the-digital-world\/#15fac33626e2\" target=\"_blank\" rel=\"noopener\">4,000 and 10,000 ads a day<\/a>. Companies fight for our attention and pay tremendous amounts of money for it. But we, the customers, receive no value from these transactions. In Pi’s attention marketplace, companies seeking to reach Pioneers will have to compensate their audience in Pi. Pi’s advertising marketplace will be strictly opt-in only and will provide an opportunity for Pioneers to monetize one of their greatest untapped resources: their attention.<\/p>\n<h3 dir=\"ltr\">Pi’s Barter Marketplace &#8211; Build Your Personal Virtual Storefront<\/h3>\n<p dir=\"ltr\">In addition to contributing trust and attention to the Pi Network, we expect Pioneers to be able to contribute their unique skills and services in the future. Pi’s mobile application will also serve as a Point of Sales where Pi’s members can offer their untapped goods and services via a “virtual storefront” to other members of the Pi Network. For example, a member offer up an underutilized room in their apartment for rent to other members on the Pi Network. In addition to real assets, members of the Pi Network will also be able to offer skills and services via their virtual storefronts. For example, a member of the Pi Network could offer their programming or design skills on the Pi marketplace. Overtime, the value of Pi will be supported by a growing basket of goods and services.<\/p>\n<h3 dir=\"ltr\">Pi’s Decentralized App Store &#8211; Lowering The Barrier Of Entry For Creators<\/h3>\n<p dir=\"ltr\">The Pi Network’s shared currency, trust graph, and marketplace will be the soil for a broader ecosystem of decentralized applications. Today, anyone that wants to start an application needs to bootstrap its technical infrastructure and community from scratch. Pi’s decentralized applications store will allow Dapp developers to leverage Pi’s existing infrastructure as well as the shared resources of the community and users. Entrepreneurs and developers can propose new Dapps to the community with requests for access to the network’s shared resources. Pi will also build its Dapps with some degree of interoperability so that Dapps are able to reference data, assets, and processes in other decentralized applications.<\/p>\n<\/div>\n scl-shortcode-cleaner-clean-content-end-->\n<div id=\"paragraph_6\" data-wysiwyg-key=\"white-paper_value_6\">\n<h3 dir=\"ltr\">Challenges w\/ 1st Generation Governance models<\/h3>\n<p dir=\"ltr\">Trust is the foundation of any successful monetary system. One of the most important factors engendering trust is governance or the process by which changes are implemented to the protocol over time. Despite its importance, governance is often one of the <a href=\"https:\/\/medium.com\/@FEhrsam\/blockchain-governance-programming-our-future-c3bfe30f2d74\" target=\"_blank\" rel=\"noopener\">most overlooked aspects of cryptoeconomic systems<\/a>.<\/p>\n<p dir=\"ltr\">First generation networks such as Bitcoin largely avoided formal (or “on-chain”) governance mechanisms in favor of informal (or “off-chain”) mechanisms arising from a combination of role and incentive design. By most measures, Bitcoin’s governance mechanisms has been quite successful, allowing the protocol to grow dramatically in scale and value since its inception. However, there have also been some challenges. The economic concentration of Bitcoin has led to a concentration of political power. The result is that everyday people can get caught in the middle of destructive battles between massive holders of Bitcoin. One of the most recent examples of this challenge has been the ongoing <a href=\"https:\/\/www.coindesk.com\/bitcoin-cash-developers-set-date-november-hard-fork\" target=\"_blank\" rel=\"noopener\">battle between Bitcoin and Bitcoin Cash<\/a>. These civil wars can end in a fork where or where the blockchain. For token holders, hard forks are inflationary and can threaten the value of their holdings.<\/p>\n<h2 dir=\"ltr\">Pi’s Governance Model &#8211; a two-phase plan<\/h2>\n<p dir=\"ltr\">In <a href=\"https:\/\/medium.com\/@Vlad_Zamfir\/against-on-chain-governance-a4ceacd040ca\" target=\"_blank\" rel=\"noopener\">an article challenging the merits of on-chain governance<\/a>, Vlad Zamfir, one of Ethereum’s core developers, argues that blockchain governance “is not an abstract design problem. It’s an applied social problem.” One of Vlad’s key points is that it is very difficult to design governance systems “a priori” or before observations of the particular challenges arising from a specific political system. One historical example is in the founding of the United States. The first experiment with democracy in the United States, the Articles of Confederation, failed after an eight-year experiment. The Founding Fathers of the United States were then able to draw upon the lessons of the Article of Confederation to craft the the Constitution &#8211; a much more successful experiment.<\/p>\n<p dir=\"ltr\">To build an enduring governance model, Pi will pursue a two-phase plan.<\/p>\n<h3 dir=\"ltr\">Provisional Governance Model (&lt; 5M Members)<\/h3>\n<p dir=\"ltr\">Until the network hits a critical mass of 5M members, Pi will operate under a provisional governance model. This model will most closely resemble “off-chain” governance models currently employed by protocols like Bitcoin and Ethereum, with Pi’s Core Team playing an important role in guiding the development of the protocol. However,, Pi’s Core Team will still rely heavily on the input of the community. The Pi mobile application itself is where Pi’s core team has been soliciting community input and engaging with Pioneers. Pi embraces community critiques and suggestions, which is implemented by the open-for-comments features of Pi’s landing page, FAQs and Whitepaper. Whenever people browse these materials on Pi’s websites, they can submit comment on a specific section right there to ask for questions and make suggestions. Offline Pioneer meetups that Pi’s core team have been organizing will also be an important channel for community input.<\/p>\n<p dir=\"ltr\">Additionally, Pi’s Core Team will develop more formal governance mechanics. One potential governance system is liquid democracy. In liquid democracy, every Pioneer will have the ability to either vote on an issue directly or to delegate their vote to another member of the network. Liquid democracy would allow for both broad and efficient membership from Pi’s community.<\/p>\n<h3 dir=\"ltr\">Pi’s “Constitutional Convention” (&gt; 5M Members)<\/h3>\n<p dir=\"ltr\">Upon hitting 5M members, a provisional committee will be formed based on previous contributions to the Pi Network. This committee will be responsible for soliciting and proposing suggestions from and to the wider community. It will also organize a series of on- and offline conversations where Pi’s members will be able to weigh on Pi’s long-term constitution. Given Pi’s global user base, the Pi Network will conduct these conventions at multiple locations across the world to ensure accessibility. In addition to hosting in-person conventions, Pi will also use its mobile application as a platform for allowing Pi’s member to participate in the process remotely. Whether in-person or online, Pi’s community members will have the ability to participate in the crafting Pi’s long-term governance structure.<\/p>\n<\/div>\n scl-shortcode-cleaner-clean-content-end-->\n<div id=\"paragraph_6\" data-wysiwyg-key=\"white-paper_value_6\">\n<h3 dir=\"ltr\">Phase 1 &#8211; Design, Distribution, Trust Graph Bootstrap.<\/h3>\n<p dir=\"ltr\">The Pi server is operating as a faucet emulating the behavior of the decentralized system as it will function once its live. During this phase improvements in the user experience and behavior are possible and relatively easy to make compared to the stable phase of the main net. All minting of coins to users will be migrated to the live net once it launches. In other words, the livenet will pre-mint  in its genesis block all account holder balances generated during Phase 1, and continue operating just like the current system but fully decentralized. Pi is not listed on exchanges during this phase and it is impossible to “buy” Pi with any other currency.<\/p>\n<h3 dir=\"ltr\">Phase 2 &#8211; Testnet<\/h3>\n<p dir=\"ltr\">Before we launch the main net, the Node software will be deployed on a test net. The test net will use the same exact trust graph as the main net but on a testing Pi coin. Pi core team will host several nodes on the test net, but will encourage more Pioneers to start their own nodes on the testnet. In fact, in order for any node to join the main net, they are advised to begin on the testnet. The test net will be run in parallel to the Pi emulator in phase one, and periodically, e.g. daily, the results from both systems will be compared to catch the gaps and misses of the test net, which will allow Pi developers to propose and implement fixes.  After a thorough concurrent run of both systems, testnet will reach a state where its results consistently match the emulator’s. At that time when the community feels its ready, Pi will migrate to the next phase.<\/p>\n<h3 dir=\"ltr\">Phase 3 &#8211; Mainnet<\/h3>\n<p dir=\"ltr\">When the community feels the software is ready for production, and it has been thoroughly tested on the testnet, the official mainnet of the Pi network will be launched. An important detail is that, in the transition into the mainnet, only accounts validated to belong to distinct real individuals will be honored. After this point, the faucet and Pi network emulator of Phase 1 will be shut down and the system will continue on its own forever. Future updates to the protocol will be contributed by the Pi developer community and Pi’s core team, and will be proposed by the committee. Their implementation and deployment will depend on nodes updating the mining software just like any other blockchains. No central authority will be controlling the currency and it will be fully decentralized. Balances of fake users or duplicate users will be discarded. This is the phase when Pi can be connected to exchanges and be exchanged for other currencies.<\/p>\n<\/div>\n scl-shortcode-cleaner-clean-content-end--><span style=\"font-weight: 400;\">Pi Network’s vision is to build the world’s most inclusive peer-to-peer ecosystem and online experience, fueled by Pi, the world’s most widely used cryptocurrency. To deliver on this vision, it is important to grow the network and make Pi widely accessible while maintaining the security of the blockchain and long-term network incentives. While these goals have always guided the token supply model and mining design, the key distinction is: the pre-Mainnet phases focused on driving network growth and widely distributing Pi and the Mainnet phase will focus on rewarding more diverse forms of Pioneer contributions necessary for ecosystem building and utilities creation. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Pre-Mainnet Supply<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">In the early stages, the focus of Pi Network was on growing and securing the network. Bootstrapping to build a critical mass of participants is paramount to any network and ecosystem. Driven by the vision to make Pi the world’s most widely used cryptocurrency, distributing Pi and making it accessible globally further added to the focus on growth. Pi’s consensus algorithm relies on a global trust graph, which is aggregated from the Security Circles of individual Pioneers. It was, therefore, critical to incentivize Pioneers to form individual Security Circles. This meant a supply of tokens available as mining rewards that was not explicitly capped before Mainnet. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">At the same time, maintaining long-term network incentives is important. As explained under the Mining section, the network adopted a mining mechanism where the network mining rate halves every time the network size increases by 10 times, resulting in a series of halving events when it reaches various milestones of engaged Pioneers. The next halving event based on this model would be when the network reaches 100 million engaged Pioneers. Currently, we have over 45 million Engaged Pioneers. The network also retained an option to stop all mining altogether in the event that the network reached a certain size, which was, however, yet to be determined. The option to cap the supply of Pi was not exercised before Mainnet, therefore leaving the total supply undefined.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The pre-Mainnet supply model with a mining mechanism tailored to accessibility, growth and security has bootstrapped a community of over 30 million engaged Pioneers with millions of intertwined Security Circles. A simple, accessible means to mine Pi on a mobile phone helped distribute the tokens widely throughout the world, including among populations that have been left out of the crypto revolution because of a lack of capital, knowledge or technology. In doing so, the network avoided the extreme token concentration evident in Bitcoin and other cryptocurrencies, preparing itself to become a true peer-to-peer decentralized ecosystem with a large enough volume of participants and transactions for utility creation.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Mainnet Supply<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Supply fuels growth and incentivizes necessary contributions to the network to achieve an organically viable ecosystem. To that end, mining rewards will continue after Mainnet but will take diverse forms to incentivize different types of contributions, which will be explained in the Mining section below. In regard to supply, the undetermined supply due to the pre-Mainnet mining mechanism that optimizes for accessibility and growth of the network presents a few problems for the Mainnet phase, including unpredictability in planning, over-rewarding and under-rewarding of different types of necessary contributions in the new phase, and challenges to maintaining long-term network incentives. To address these issues, the network will shift from its pre-Mainnet supply model that is completely dependent on network behavior to the Mainnet supply model where there is a clear maximum supply. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The issue of unpredictability for planning in the pre-Mainnet supply model surfaced in Pi Network’s first COiNVENTION in September-October 2020 where the community panel and community submissions discussed whether mining should be halved or stopped at the network size of 10 million at the time. The diverse voices of community members presented the following  dilemma for the network. If mining continued based on the ongoing (pre-Mainnet) mining mechanism, then it raised concerns with respect to Pi’s ability to provide long-term network incentives. However, if mining stopped, it would hurt the growth of the network and prevent new Pioneers joining the network as miners, thereby undermining the accessibility of  Pi. Even though the network moved on from that decision and halved the mining rate at its 10 Million size, this dilemma still remains and needs to be resolved. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">How the community can achieve continued growth and accessibility while addressing concerns about supply is one of the main factors considered in the design of the Mainnet token model. In addition, the undefined and unpredictable total supply makes it hard to have overall network token planning because the community as a collective and the ecosystem itself have needs to use some Pi for purposes that benefit the community and ecosystem as a whole, other than only mining rewards for individuals, as evidenced by almost every other blockchain network. Clear allocations for such collective community purposes need to be defined. Hence, given the current network size of over 30 million Pioneers and the expected volume of transactions and activities in the future, the Mainnet supply model has a clear <\/span><b>maximum total supply of 100 billion Pi<\/b><span style=\"font-weight: 400;\"> allowing incentivizations of continued growth and new contributions while removing the concerns about the unpredictability of the supply. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The supply distribution will honor the original distribution principle in the March 14, 2019 Whitepaper—the Pi community has 80% and the Pi Core Team has 20% of the total circulating supply of Pi, regardless of how much circulating supply there is in the Pi Network at any given point in time. Thus, given a total max supply of 100 billion Pi, the community will eventually receive 80 billion Pi and the Core Team will eventually receive 20 billion Pi. The following pie chart depicts the overall distribution. The Core Team’s allocation gets unlocked at the same pace as the community progressively mines more and more Pi and may be subject to additional lockup through a self-imposed mandate. This means that if the community has a portion of its allocation in circulation (for example, 25%), only the proportional amount in Core Team’s allocation (in this example, 25%) can get unlocked at most.<\/span> scl-shortcode-cleaner-clean-content-end--><!--scl-shortcode-cleaner-clean-content-start \n<p id=\"e875\" class=\"pw-post-body-paragraph jp jq ir jr b js jt ju jv jw jx jy jz ka kb kc kd ke kf kg kh ki kj kk kl km id gl\" data-selectable-paragraph=\"\">This distribution above shows that Pi Network does not have any allocation for ICO and is NOT running any type of crowdfunding sales of Pi. Thus, any impersonation of Pi Network or its founders to conduct a sale or listing is illegal, unauthorized and fake. These impersonators have no affiliation with Pi Core Team. Pioneers should beware of any scams and not participate. Pi can be mined freely by contributing to the ecosystem. Further, all mined Pi can only be claimed from inside the Pi App through the Mainnet dashboard and then transferred into your Pi wallet. Any website asking Pioneers to claim Pi in other means is fake.<\/p>\n<p id=\"2ca1\" class=\"pw-post-body-paragraph jp jq ir jr b js jt ju jv jw jx jy jz ka kb kc kd ke kf kg kh ki kj kk kl km id gl\" data-selectable-paragraph=\"\">The 80% of the community supply is further divided into: 65% allocated for all past and future Pioneer mining rewards, at address GBQQRIQKS7XLMWTTRM2EPMTRLPUGQJDLEKCGNDIFGTBZG4GL5CHHJI25 on the Mainnet, 10% reserved for supporting community organization and ecosystem building that will eventually be managed by a Pi Foundation, a non-profit organization in the future, at address GDPDSLFVGEPX6FJKGZXSTJCPTSKKAI4KBHBAQCCKQDXISW3S5SJ6MGMS, and 5% reserved for the liquidity pool to provide liquidity for Pioneers and developers in the Pi ecosystem at address GB7HLN74IIY6PENSHHBBJJXWV6IZQDELTBZNXXORDGTL75O4KC5CUXEV. The following table depicts the community supply distribution:<\/p>\n scl-shortcode-cleaner-clean-content-end--><!--scl-shortcode-cleaner-clean-content-start <span style=\"font-weight: 400;\">65 Billion Pi will be allocated for all mining rewards—both past and future mining. For past mining rewards, the rough sum of all Pi mined by all Pioneers so far (before Mainnet) is about 30 Billion Pi. However, after prohibiting the migration of the Pi in fake accounts (as discussed in the subsections “The Effect of KYC on Mainnet rewards” and “KYC Verification and Mainnet Balance Transfer” below) and depending on the speed and participation of KYC, the pre-Mainnet mined Pi at the beginning of the Open Network can be estimated to range from 10 to 20 Billion. The remaining amount in the 65 billion Pi supply for mining rewards will be distributed to Pioneers through the new Mainnet mining mechanism<\/span><span style=\"font-weight: 400;\"> with conceptual yearly supply limits. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Such yearly supply limits will be determined based on a declining formula. The yearly limit may be computed on a more granular basis such as by the day or by an even smaller time epoch dynamically, depending on factors such as the lockup ratio and the remaining supply of the network at the time. Such calculation of supply limits based on granular time epochs helps achieve a better and more smooth allocation curve through time. For the sake of simplicity here, let’s suppose that the time epoch is yearly. The declining formula would mean that the yearly supply limit for the first year of new Mainnet mining will be higher than for the second year, the second year’s higher than the third year’s, and so on. The yearly declining formula and these numbers will need to be finalized closer to the launch of the Open Network period of Mainnet once we will have seen how many Pioneers have KYC’ed and how much of their mined Pi they have transferred into Mainnet.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">At Mainnet, Pioneers will be rewarded for their continued contributions to the growth and security of the network. As explained in the Mining section, Pioneer rewards will be further diversified because the network needs more diverse and in-depth contributions related to app usage, node operation, and Pi lockup. Pre-Mainnet Pioneers will continue to contribute to Pi and mine from the Mainnet mining rewards, along with any new members joining the network, to ensure growth and longevity of the network.   <\/span><\/p>\n<p><span style=\"font-weight: 400;\">10 Billion Pi will be reserved for community organization and ecosystem building that will be, in the future, managed by a non-profit foundation. Most decentralized networks or cryptocurrencies, even though they are decentralized, still need an organization to organize the community and set the future direction of the ecosystem, e.g., Ethereum and Stellar. The future Pi foundation will (1) organize and sponsor community events, such as developer conventions, global online events and local community meetings, (2) organize volunteers and committee members, and pay full-time employees who are dedicated to building the community and ecosystem, (3) gather opinions and feedback from the community, (4) organize future community votings, (5) build branding and protect the reputation of the network, (6) represent the network to interact with other business entities including governments, traditional banks, and traditional enterprises, or (7) fulfill any number of responsibilities for the betterness of the Pi community and ecosystem. Further, in order to build a utilities-based Pi ecosystem, various community developer programs will be designed, created and carried out by the foundation to support community developers in the forms of grants, incubations, partnerships, etc. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">5 billion Pi will be reserved for liquidity pools to provide liquidity for any ecosystem participants, including Pioneers and Pi apps developers. Liquidity is key for an ecosystem to be viable, active, and healthy. If businesses or individuals want to participate in ecosystem activities (e.g., by selling and buying goods and services in Pi), they must have timely access to Pi. Without liquidity, the ecosystem will not have a healthy flow of Pi, hence harming the creation of utilities. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As discussed in the Roadmap chapter, one benefit of the Enclosed Network period of the Mainnet is to allow calibrations on the token model, if any, based on the early Mainnet results. Therefore, the token model is subject to tweaking before the Open Network period starts. Also, in the future, for the health of the network and ecosystem, the network may face questions such as whether there needs to be any inflation after the completion of the distribution of the 100 Billion Pi. The inflation may be necessary to further incentivize contributions through more mining rewards, make up for any loss of Pi from circulation due to accidents or death, provide for more liquidity, mitigate hoarding that inhibits usage and utility creation, etc. At that time, the foundation and its committees specialized in these matters will organize and guide the community to reach a conclusion on the matter in a decentralized way.  <\/span> scl-shortcode-cleaner-clean-content-end--><span style=\"font-weight: 400;\">Pi Network’s mining <\/span><span style=\"font-weight: 400;\">mechanism has been allowing<\/span><span style=\"font-weight: 400;\"> Pioneers to contribute to the growth, distribution and security of the network and be rewarded in Pi meritocratically. The pre-Mainnet mining mechanism has helped the network achieve an impressive growth of over <\/span><span style=\"font-weight: 400;\">35 <\/span><span style=\"font-weight: 400;\">million engaged members, a widely distributed currency and Testnet, and a trust graph of Security Circle aggregates that will feed the consensus algorithm of the Pi blockchain. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Looking ahead into the Mainnet phase, Pi Network needs further contributions, as well as more diverse types of contributions from all its members, to become a true ecosystem while continuing its growth and inclusion. In the Mainnet phase, we want to further achieve <\/span><b>decentralization<\/b><span style=\"font-weight: 400;\">,<\/span><b> utilities<\/b><span style=\"font-weight: 400;\">,<\/span><b> stability<\/b><span style=\"font-weight: 400;\"> and <\/span><b>longevity,<\/b><span style=\"font-weight: 400;\"> in addition to<\/span><b> growth<\/b><span style=\"font-weight: 400;\">,<\/span><b> inclusion<\/b><span style=\"font-weight: 400;\">, and<\/span><b> security<\/b><span style=\"font-weight: 400;\">. These goals can only be achieved if all Pioneers in the network work together. Hence, the new Pi mining mechanism is designed to achieve these goals by incentivizing all Pioneers to contribute diversely to the network based on the same meritocratic principle. Below, we first describe the pre-Mainnet mining formula, followed by the changes in the Mainnet formula. The Mainnet mining formula went into effect in March, 2022 – during the Enclosed Mainnet period of the Roadmap that started on December 28, 2021. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Pre-Mainnet Formula<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The pre-Mainnet mining formula demonstrates a meritocratic determination of a Pioneer’s hourly mining rate. Actively mining Pioneers received at least a minimum rate and were further rewarded for their contributions to security and growth of the network. The following formula determined the rate at which Pioneers mined Pi per hour: <\/span><\/p>\n<p><span style=\"font-weight: 400;\">M = I(B,S) + E(I), where<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">M is the total Pioneer mining rate, <\/span><\/li>\n<li><span style=\"font-weight: 400;\">I is the Individual Pioneer base mining rate, <\/span><\/li>\n<li><span style=\"font-weight: 400;\">B is the systemwide base mining rate, <\/span><\/li>\n<li><span style=\"font-weight: 400;\">S is the Security Circle reward, which is a component of the individual Pioneer base mining rate from valid Security Circle connections, and <\/span><\/li>\n<li><span style=\"font-weight: 400;\">E is the Referral Team reward from active Referral Team members. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The systemwide base mining rate B started as 3.1415926 Pi\/h and halved every time the network of Engaged Pioneers increased in size by a factor of 10x, starting at 1000 Pioneers. As listed below, there have been five halving events thus far: <\/span> scl-shortcode-cleaner-clean-content-end--><!--scl-shortcode-cleaner-clean-content-start <span style=\"font-weight: 400;\">Here,<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">I(B,S) = B + S(B)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">S(B) = 0.2 • min(Sc,5) • B, where<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Sc is the count of valid Security Circle connections.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">E(I) = Ec • I(B,S) • 0.25, where<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Ec is the count of active Referral Team members who mine concurrently.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The mining formula can also be written as a multiple of B: <\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">M = I(B,S) + E(I)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">M =  + , or<\/span><\/li>\n<li><span style=\"font-weight: 400;\">M =  + , or<\/span><\/li>\n<li><span style=\"font-weight: 400;\">M = B • , or<\/span><\/li>\n<li><span style=\"font-weight: 400;\">M = B • <\/span><\/li>\n<\/ul>\n<h4><span style=\"font-weight: 400;\">Pre-Mainnet Systemwide Base Mining Rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Every active Pioneer received at least the systemwide base mining rate (B). That is, if Sc = 0 and Ec = 0 in the mining formula above, then M = B. In any case, the total Pioneer mining rate was a multiple of the systemwide base mining rate. The value of B was pre-determined before the Mainnet, and as shown in the table above, it changed only five times. The max supply was undetermined due to the dynamic progress of the pre-Mainnet mining mechanism, e.g. how large the network is and how fast the network reaches the next halving event. It would only be determined when B dropped to 0. However, as explained in the next section, the value of B at Mainnet is calculated in real time, dynamically adjusting based on the total annual Pi supply and the total mining coefficient across all the Pioneers. The supply of Pi is finite at Mainnet.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Security Circle Reward<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Pi’s consensus algorithm relies on a global trust graph, which is aggregated from the millions of intertwining Security Circles of individual Pioneers. Thus, a Pioneer was rewarded with additional Pi per hour for each <\/span><span style=\"font-weight: 400;\">new valid Security Circle connection, up to 5 such connections. The Security Circles are so central to the security of the Pi blockchain that the Security Circle reward raised the total Pioneer mining rate in two ways: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">by directly adding to the individual Pioneer base mining rate (I), and <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">by boosting the Referral Team reward, if any. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">In fact, a full Security Circle—that is, having at least five valid connections—doubled both the individual Pioneer base mining rate and the Referral Team reward. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Referral Team Reward<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Pioneers can also invite others to join Pi Network and form their Referral Team. The inviter and invitee share an equal split of the Referral Team bonus rewards, that is a 25% boost to their respective individual Pioneer base mining rates, whenever both are mining concurrently. Pioneers mined more Pi per hour with each concurrently mining Referral Team member. This Referral Team reward recognized the Pioneers’ contribution to the growth of the network and the distribution of the Pi token.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Mainnet Mining Formula<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The goals of the Mainnet phase are to make further progress in <\/span><i><span style=\"font-weight: 400;\">decentralization<\/span><\/i><span style=\"font-weight: 400;\"> and <\/span><i><span style=\"font-weight: 400;\">utilities<\/span><\/i><span style=\"font-weight: 400;\">, ensure <\/span><i><span style=\"font-weight: 400;\">stability<\/span><\/i><span style=\"font-weight: 400;\"> and <\/span><i><span style=\"font-weight: 400;\">longevity<\/span><\/i><span style=\"font-weight: 400;\">, and retain <\/span><i><span style=\"font-weight: 400;\">growth<\/span><\/i><span style=\"font-weight: 400;\"> and <\/span><i><span style=\"font-weight: 400;\">security<\/span><\/i><span style=\"font-weight: 400;\">. The new formula, as written below, incentivizes more diverse contributions of Pioneers to support these Mainnet goals while retaining the incentives to secure and grow the network. As before, it is meritocratic and expressed as the rate at which Pioneers mine Pi per hour. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">M = I(B,L,S) + E(I) + N(I) + A(I) + X(B), where<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>M<\/b><span style=\"font-weight: 400;\"> is the total Pioneer mining rate, <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>I<\/b><span style=\"font-weight: 400;\"> is the individual Pioneer base mining rate, <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>B<\/b><span style=\"font-weight: 400;\"> is the systemwide base mining rate (adjusted based on the available pool of Pi to distribute for a given time period), <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>L<\/b><span style=\"font-weight: 400;\"> is the lockup reward, which is a new component of the individual Pioneer base mining rate,<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>S<\/b><span style=\"font-weight: 400;\"> is the the Security Circle reward, which is a component of the individual Pioneer base mining rate from valid Security Circle connections the same way as in the pre-Mainnet mining formula, <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>E<\/b><span style=\"font-weight: 400;\"> is the Referral Team reward from active Referral Team members the same way as in the pre-Mainnet mining formula, <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>N<\/b><span style=\"font-weight: 400;\"> is the Node reward, <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>A<\/b><span style=\"font-weight: 400;\"> is the Pi apps usage reward, and<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>X<\/b><span style=\"font-weight: 400;\"> are new types of contributions necessary for the network ecosystem in the future, which will be determined later, but will also be designed as a multiple of B. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">In short, S and E remain the same as in the pre-Mainnet mining formula, while new rewards such as L, N and A  have been added to the current formula. L is added as part of I; N and A are added as additional rewards calculated based on I. In other words, the network still rewards <\/span><i><span style=\"font-weight: 400;\">growth<\/span><\/i><span style=\"font-weight: 400;\"> through E and <\/span><i><span style=\"font-weight: 400;\">security<\/span><\/i><span style=\"font-weight: 400;\"> through S, while incentivizing Pioneers’ contributions to running nodes for <\/span><i><span style=\"font-weight: 400;\">decentralization<\/span><\/i><span style=\"font-weight: 400;\"> through N, using apps for <\/span><i><span style=\"font-weight: 400;\">utilities<\/span><\/i><span style=\"font-weight: 400;\"> creation through A, and locking up for <\/span><i><span style=\"font-weight: 400;\">stability<\/span><\/i><span style=\"font-weight: 400;\"> especially during the initial years through L. Further, new types of rewards to Pioneers through X in the future may be added for building a fully functioning <\/span><i><span style=\"font-weight: 400;\">ecosystem<\/span><\/i><span style=\"font-weight: 400;\">, such as rewards for Pioneer developers creating successful Pi apps. B continues to exist over a long period of time while having a yearly cap to ensure <\/span><i><span style=\"font-weight: 400;\">longevity<\/span><\/i><span style=\"font-weight: 400;\"> of network <\/span><i><span style=\"font-weight: 400;\">growth<\/span><\/i><span style=\"font-weight: 400;\"> bywhile maintaining long-term network incentives. In fact, all the rewards can be expressed in B as follows. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here, <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I(B,L,S) = B + S(B) + L(B)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">S(B) = 0.2 • min(Sc,5) • B, where<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Sc is the count of valid Security Circle connections.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">E(I) = Ec • 0.25 • I(B,L,S), where<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Ec is the count of active Referral Team members.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">L(B) = Lt • Lp • log(N) • B, where<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Lt is a multiplier corresponding to the duration of a lockup, <\/span><\/li>\n<li><span style=\"font-weight: 400;\">Lp is the proportion of Pioneer’s mined Pi on the Mainnet that is locked up with the maximum being 200%, and <\/span><\/li>\n<li><span style=\"font-weight: 400;\">N is the total number of Pioneer&#8217;s mining sessions preceding the current mining session.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">N(I) = node_factor • tuning_factor • I, where<\/span><\/p>\n<ul>\n<li><b>Node_factor<\/b><span style=\"font-weight: 400;\"> = Percent_uptime_last_1_days • (Uptime_factor + Port_open_factor + CPU_factor), where<\/span><\/li>\n<li><b>Uptime_factor<\/b><span style=\"font-weight: 400;\"> = (Percent_uptime_last_90_days + 1.5*Percent_uptime_last_360_days(360-90) + 2* Percent_uptime_last_2_years + 3*Percent_uptime_last_10_years),<\/span><\/li>\n<li><b>Port_open_factor<\/b><span style=\"font-weight: 400;\"> = 1 + percent_ports_open_last_90_days + 1.5*percent_ports_open_last_360_days + 2* percent_ports_open_last_2_years + 3*percent_ports_open_last_10_years,<\/span><\/li>\n<li><b>CPU_factor<\/b><span style=\"font-weight: 400;\"> = (1 + avg_CPU_count_last_90_days + 1.5*avg_CPU_count_last_360_days + 2* avg_CPU_count_last_2_years + 3*avg_CPU_count_last_10_years)\/4. <\/span><\/li>\n<\/ul>\n<p>and<\/p>\n<ul>\n<li><b>Percent_uptime_last_*_days\/years<\/b><span style=\"font-weight: 400;\"> is the percentage of the last * time period when the individual Node was live and accessible by the network. <\/span><\/li>\n<li><b>percent_ports_open_last_*_days\/years<\/b><span style=\"font-weight: 400;\"> is the percentage of the last * time period when the ports of the individual Node were open for connectivity to the network.<\/span><\/li>\n<li><b>avg_CPU_count_last_*_days\/years<\/b><span style=\"font-weight: 400;\"> is the average CPU that the individual Node provided to the network during the last * time period. <\/span><\/li>\n<li><b>tuning_factor<\/b><span style=\"font-weight: 400;\"> is a statistical factor that normalizes the node_factor to a number between 0 and 10. <\/span><span style=\"font-weight: 400;\"> <\/span><\/li>\n<\/ul>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"alignnone wp-image-994 size-full\" src=\"https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6.jpg\" alt=\"\" width=\"813\" height=\"326\" srcset=\"https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6.jpg 813w, https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6-300x120.jpg 300w, https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6-768x308.jpg 768w, https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6-18x7.jpg 18w\" sizes=\"(max-width: 813px) 100vw, 813px\" \/><\/p>\n<ul>\n<li><b>time_spent_per_app_yesterday_in_seconds<\/b><span style=\"font-weight: 400;\"> is, for each Pi app, the total amount of time in seconds that the Pioneer spends using the app on the prior day.<\/span><\/li>\n<li><b>Σ_across_apps<\/b><span style=\"font-weight: 400;\"> sums up the logarithmic value of the Pioneer’s time_spent_per_app_yesterday_in_seconds across all the Pi apps. <\/span><\/li>\n<li><b>avg_daily_time_spent_across_apps_last_*_days\/years<\/b><span style=\"font-weight: 400;\"> is the average daily time in seconds the Pioneer spends across all the Pi apps in the aggregate during the last * time period. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">* Note that when any of the logarithmic functions returns an undefined value or a value below 0 (that is, when, the input to the logarithmic function is below 1), the formula resets the value of the logarithmic function to be 0 in order to avoid negative mining rewards or an error in the function. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">X(B) is to be determined in the future based on the new types of contributions, but will be a multiple of B and kept within the yearly supply limit along with other rewards. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As shown above, the expressions of S and E remain the same as in the pre-Mainnet mining formula, and will not be explained further here. Next, we will focus on explaining the changes to B, changes to I through L, and the additions of N and A.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Systemwide Base Mining Rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Like in Pre-Mainnet mining, all of the terms in the Mainnet mining formula above can be expressed in Pi per hour and are designed to be a multiple of B. Hence, the equation can also be re-written as below. <\/span><span style=\"font-weight: 400;\">Every Pioneer can mine at least the Systemwide Base Mining Rate everyday, and will be able to mine at a higher rate if they also have other types of contributions that are calculated as multiples of B.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">M = B <\/span><span style=\"font-weight: 400;\">• <\/span><span style=\"font-weight: 400;\">(1 + S + L) <\/span><span style=\"font-weight: 400;\">•<\/span><span style=\"font-weight: 400;\"> (1 + N + E + A + X)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Unlike in the pre-Mainnet mining, B in Mainnet mining as in the formula above is no longer a constant across all Pioneers at a given point in time, but is calculated in real time and dynamically adjusted based on a yearly supply cap. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Given a yearly supply limit<\/span><span style=\"font-weight: 400;\">, it is impossible to keep a constant B like in the pre-Mainnet period because it’s unpredictable how much each Pioneer mines and how many Pioneers are actively mining during a period of time. The pre-Mainnet model was designed to incentivize growth during the beginning years to bootstrap the network. As the network achieves a certain scale, it also needs to ensure the overall health of the ecosystem. Therefore, an exponential issuance of the tokens through exponential network growth and a constant mining rate does not make sense any longer. The shift of B from being a constant to <\/span><span style=\"font-weight: 400;\">being dynamically adjusted<\/span><span style=\"font-weight: 400;\"> for a certain period of time <\/span><span style=\"font-weight: 400;\">throughout the year<\/span><span style=\"font-weight: 400;\"> results from the need to incentivize Pioneers’ contributions meritocratically but also to keep the total rewards within a limit. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The time period for adjusting B could be yearly, monthly, daily, hourly, or even more granular. Pi Network will iterate on this time period over time based on careful monitoring and review.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The first version of the <\/span><b><i>Rewards Issuance Formula <\/i><\/b><span style=\"font-weight: 400;\">was announced March 1st 2022—the <\/span><i><span style=\"font-weight: 400;\">declining exponential function<\/span><\/i><span style=\"font-weight: 400;\"> described below—whereby in combination with mining activities, <\/span><b>the systemwide base mining rate (B) is adjusted<\/b><span style=\"font-weight: 400;\"> based on a <\/span><b>monthly<\/b><span style=\"font-weight: 400;\"> supply limit determined by the formula. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Please note that the declining exponential formula below is the first version of the Rewards Issuance Formula, as it is impossible to precisely predict the future data on Mainnet and from new mining. This first version was designed based on past data, simulations and best assumptions, such as the 35 billion remaining supply for future mining rewards, Pioneer lockups and overall ecosystem factors. For example, the 35 billion remaining Pi is estimated based on the currently available data about real Pioneers’ mobile balances. A more accurate figure will be determined by the speed of network KYC and how much Pi is migrated to the Mainnet in the future. Further data and continual simulations will help assess such underlying assumptions in the rewards issuance formula, and thus may lead to the formula’s adjustment in line with the network’s objectives.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">supply_limits (expressed in Pi\/day)<\/span><span style=\"font-weight: 400;\">  = exp (<\/span><span style=\"font-weight: 400;\">&#8211;<\/span><span style=\"font-weight: 400;\">last_day_total_mining_rewards \/ 1220) • 35,000,000,000, where <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">supply_limits<\/span><\/i><span style=\"font-weight: 400;\"> are the output of this formula that allocates a specific amount of Pi to each day for the indefinite time while making sure the total future issuance will not exceed the remaining available supply,<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">last_day_total_mining_rewards <\/span><\/i><span style=\"font-weight: 400;\">is equal to the total Pi mining rewards issued on the previous day,<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">1220 is a tuning factor to be further tuned over the coming months, and<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">35 billion is the estimated number of Pi available for Pioneers to mine going forward. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">This monthly B means that that B will stay constant for a month and will be adjusted based on the rewards issuance formula and the network’s mining activities at the end of each month. Starting with a B that stays constant for a month helps Pioneers understand the implications of 1) new supply limits, 2) the new mining mechanism with new rewards, and 3) a more dynamic nature of B (potentially in the future) one at a time, given that these concepts are complex and all have an effect on Pioneers’ mining rewards. At the same time, a monthly period is short enough to correct any potential over- or under-issuance of Pi deviating from the rewards issuance formula while B is stable long enough for Pioneers to follow along and adjust their contributions to the network to mine for rewards. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Each month’s B is calculated based on the supply limit for the month based on this formula and the sum of all reward coefficients of all active Pioneers from the last day of the previous month. This B updates again on the first day of every month. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">More specifically, the value of B for a given month is calculated by:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Summing up the daily <\/span><i><span style=\"font-weight: 400;\">supply_limits<\/span><\/i><span style=\"font-weight: 400;\"> for the month from the above rewards issuance formula<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Dividing it by the number of days in the month for even daily allocation within the month <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Dividing it again by the sum of coefficients (sum_of_B_multiples) of mining rewards of all active Pioneers of<\/span><span style=\"font-weight: 400;\"> the last day of the previous month—incl<\/span><span style=\"font-weight: 400;\">uding their multiples of Referral Team, Security Circle, Pi Lockup, App usage, and Node Operation rewards <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Similar iterations occur each month.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When B stays constant in a month, the <\/span><i><span style=\"font-weight: 400;\">total<\/span><\/i><span style=\"font-weight: 400;\"> number of Pi actually mined every month varies with the total number of actively mining Pioneers and the contributions they make in that month. At the end of the month, the total number of Pi actually mined will be compared with the number initially projected by the formula. Any deviation between the two numbers each month will lead to a further adjustment on the remaining Pi supply, across the remaining indefinite mining period, along with any other types of adjustments explained above, e.g. the assumed 35 billion remaining mining rewards supply. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As such, the monthly B can potentially cause an overissuance of Pi when there is an unexpected increase in the number of Pioneers and their mining rates, leading to a deviation from the rewards issuance formula. If such deviation on a monthly basis is constantly large, the network can move to a more dynamic version of the B model where the monthly issuance of Pi remains constant but B gets adjusted on a more granular time epoch basis. The shorter the time period for adjusting B to follow the formula, the less is the potential for over- or under-issuance against the targeted supply limits, and the less is the chance for deviation from the formula over that period. More data on Mainnet and the new mining mechanism will help examine the efficacy of the current monthly dynamic B and determine if a more dynamic version B is necessary. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, if the B is calculated <\/span><b><i>daily<\/i><\/b><i><span style=\"font-weight: 400;\">,<\/span><\/i><span style=\"font-weight: 400;\"> instead of the current <\/span><i><span style=\"font-weight: 400;\">monthly<\/span><\/i><span style=\"font-weight: 400;\"> version, for a given <\/span><i><span style=\"font-weight: 400;\">day<\/span><\/i><span style=\"font-weight: 400;\"> of the year, <\/span><\/p>\n<p><span style=\"font-weight: 400;\">B = day_supply \/ (sum_of_B_multiples <\/span><span style=\"font-weight: 400;\">• <\/span><span style=\"font-weight: 400;\">24h)<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Divide the remaining total Pi supply of the year by the number of days left in the year to get day_supply based on the remaining yearly supply,<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Add the multiples of B from <\/span><i><span style=\"font-weight: 400;\">all Pioneers<\/span><\/i><span style=\"font-weight: 400;\"> actively mining within the last 24 hours, which represents a diverse set of Pioneers’ contributions, in the Mainnet mining formula above to get the sum_of_B_multiples of the whole network for that 24-hour window, and <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Further divide day_supply by sum_of_B_multiples and 24 hours to get B of that specific mining session.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Under this potential framework with a <\/span><i><span style=\"font-weight: 400;\">day<\/span><\/i><span style=\"font-weight: 400;\"> as the unit of time for adjustment, B on different days of the year will be different depending on how many Pioneers mined in the last 24 hours as well as what and how much contributions they made to receive the extra multiples of B by running nodes, using utilities apps or lockups, etc. Each Pioneer’s B of their day stays constant through their mining session, that is, over the next 24 hours from the moment they start their mining session. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This model, whether it is monthly, daily or by more granular time periods, also addresses any uncertainty with having X(B)—future types of contribution rewards for Pioneers—in the formula. Regardless of how much X is going to be, it will be kept within the same yearly supply limit without increasing the total supply and will only affect the division of rewards among different types of contributions. This dynamic mechanism allows Pioneers themselves, in a decentralized way, to make sure that (1) the rewards do not exceed the yearly supply limit, (2) the distribution of the yearly supply does not end early in the year, and (3) the rewards are divided meritocratically.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For purposes of illustration, let’s suppose there are only two Pioneers on a given day and B is the daily mining rate (expressed in Pi\/day for this illustration)—a constant during a specific Pioneer mining session, but dynamically adjusted across different <\/span><i><span style=\"font-weight: 400;\">days<\/span><\/i><span style=\"font-weight: 400;\">:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Pioneer 1 has no app engagement (A=0), is not operating a Node (N=0), has no security connections (S=0), and has no active Referral Team members (E=0). They are in their 11th mining session (N=10) and are locking up 100% of their mined Pi (Lp=1) for 3 years (Lt=2). Pioneer 1’s mining rate on this day is: <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">                 M1 = I(B,L,S) + 0 + 0 + 0, or<\/span><\/p>\n<p><span style=\"font-weight: 400;\">                  M1 = B + {2 • 1 • log(10)} • B + 0, or<\/span><\/p>\n<p><span style=\"font-weight: 400;\">                  M1 = 3B<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Pioneer 2 has no app engagement (A=0), is not operating a Node (N=0), has no lockup (L=0), and has no active Referral Team members (E=0). They have a full Security Circle. Pioneer 2’s mining rate on this day is: <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">                  M2 = I(B,L,S) + 0 + 0 + 0, or<\/span><\/p>\n<p><span style=\"font-weight: 400;\">                  M2 = B + 0 + {0.2 • min(Sc,5) • B}, or<\/span><\/p>\n<p><span style=\"font-weight: 400;\">                  M2 = B + {0.2 • 5 • B}, or<\/span><\/p>\n<p><span style=\"font-weight: 400;\">                  M2 = 2B<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Here, Total Pi to be mined in the whole network on this day = M1 + M2 = 5B<br \/>\n<\/span>Let’s assume there are 500 Pi and 50 days left in the year.<br \/>\nTherefore, Total Pi available to be mined for this day = 500 Pi \/ 50 days = 10 Pi\/day<\/li>\n<li><span style=\"font-weight: 400;\">Solving B based on the two equations above, <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">                  5B=10 Pi ⇒ B = 2 Pi\/day (or 0.083 Pi\/hour)<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Accordingly, Pioneers 1 and 2 will have their actual mining rates as follows:<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">                  M1 = 3 • 2 Pi\/day = 6 Pi\/day (or 0.25 Pi\/hour)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">                  M2 = 2 • 2 Pi\/day = 4 Pi\/day (or 0.17 Pi\/hour)<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Pioneer Base Mining rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">By comparison, the individual Pioneer base mining rate in the pre-Mainnet mining formula includes only system-wide base mining rate and Security Circle rewards. At Mainnet, a new component, lockup reward, is added to individual Pioneer base mining rate I. Lockup rewards L, along with the system-wide base mining rate B and Security Circle reward S, constitute the individual Pioneer base mining rate I. Since I is used as an input to calculate all the other rewards,  as a result, the Security Circle and lockup rewards enhance the total Pioneer mining rate by: (1) by directly adding to the individual Pioneer base mining rate and (2) by boosting the any Referral Team reward E, nodes reward N, and app usage reward A.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Lockup Reward<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">At Mainnet, the lockup reward is meant to support a healthy and smooth ecosystem and incentivize long-term engagement with the network, while the network is bootstrapping and creating utilities. It is an important decentralized macroeconomic mechanism to moderate circulating supply in the market, especially in the early years of the open market when utilities are being created. One important goal of the Pi Network is to create a utility-based ecosystem of apps. Transactions for real goods and services in the ecosystem, rather than just speculative trading, are intended to determine the utility of Pi. As we launch the Enclosed Network phase of the Mainnet, one of the main areas of focus will be to support and grow the Pi app developer community and nurture more Pi apps to grow. In the meantime, Pioneers can choose to lock up their Pi to help create a stable market environment for the ecosystem to mature and for more Pi apps to emerge and provide compelling use cases for spending Pi – to ultimately create organic demands through utilities.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The lockup reward formula is reprinted here:<\/span><\/p>\n<ul>\n<li><b>L(B) = Lt • Lp • log(N) • B<\/b><span style=\"font-weight: 400;\">, where <\/span><\/li>\n<\/ul>\n<p><b><span style=\"font-weight: 400;\">        <\/span> <span style=\"font-weight: 400;\">        <\/span> Lt <\/b><span style=\"font-weight: 400;\">is the<\/span> <i><span style=\"font-weight: 400;\">Lockup Time period multiplier<\/span><\/i><span style=\"font-weight: 400;\"> of B.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<p><span style=\"font-weight: 400;\">                           0              → Lt = 0<\/span><\/p>\n<p><span style=\"font-weight: 400;\">                          2 weeks   → Lt = 0.1 <\/span><\/p>\n<p><span style=\"font-weight: 400;\">                           6 months → Lt = 0.5  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">                           1 year      → Lt = 1    <\/span><\/p>\n<p><span style=\"font-weight: 400;\">                           3 years    → Lt = 2 <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<ul>\n<li><b>Lp<\/b><span style=\"font-weight: 400;\"> is the <\/span><i><span style=\"font-weight: 400;\">Lockup Percentage multiplier<\/span><\/i><span style=\"font-weight: 400;\"> of B, where<\/span>\n<ul>\n<li><span style=\"font-weight: 400;\">the Lockup Percentage is the lockup amount over the Mainnet Balance transferred from one’s previous mining rewards (Lb), and the <\/span><i><span style=\"font-weight: 400;\">Lockup Percentage multiplier<\/span><\/i><span style=\"font-weight: 400;\"> is as follows.<\/span><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">         0% → Lp = 0<\/span><\/p>\n<p><span style=\"font-weight: 400;\">         25% → Lp = 0.25 <\/span><\/p>\n<p><span style=\"font-weight: 400;\">         50% → Lp = 0.5<\/span><\/p>\n<p><span style=\"font-weight: 400;\">         90% → Lp = 0.9<\/span><\/p>\n<p><span style=\"font-weight: 400;\">         100% → Lp = 1.0<\/span><\/p>\n<p><span style=\"font-weight: 400;\">         150% → Lp = 1.5<\/span><\/p>\n<p><span style=\"font-weight: 400;\">         200% → Lp = 2<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<ul>\n<li><b>log(N) <\/b><span style=\"font-weight: 400;\">is the logarithmic value of the total number of previous mining sessions (N).<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Pioneers will have the opportunity to voluntarily lock up their Pi to earn the right to mine at a higher rate. First of all, the prerequisite of the lockup reward is that the Pioneer must be actively mining. Without mining in the first place, there will be no lockup rewards for any inactive mining sessions, even if Pi is locked up. As expressed in the formula above, all that the lockup does is to provide multipliers to B, so there will be no lockup rewards if B is 0 (which means the Pioneers is not mining). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Secondly, the lockup reward is positively associated with the contribution to the lockup, i.e. the duration of the lockup time period (Lt) and the amount locked up. However the lockup amount is accounted for by the percentage of a Pioneer’s total Pi mined (Lp). The maximum Pi that a Pioneer can lock up is twice as much as their Mainnet Balance that got transferred from their prior mining in the mobile app (Lb), i.e. 200% Lb. The reasons for having a 2X maximum lockup amount of one’s transferred Mainnet Balance (Lb) are to 1) prevent exploitation of the lockup reward and 2) further encourage other contributions to the Pi ecosystem, such as further boosting their mining, running nodes and using apps. This, in a sense, favors Pioneers who mine and make other types of contributions to the network. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Thirdly, Log(N) offers a higher lockup incentive to Pioneers who have a long mining history and presumably a large transferable balance to lock up. While the lockup reward formula generally favors <\/span><i><span style=\"font-weight: 400;\">equality<\/span><\/i><span style=\"font-weight: 400;\"> by accounting for not the absolute amount but the percentage of their transferred balance (Lp) — which allows smaller accounts with a short mining history to lock up small amounts and yet receive the same lockup reward multiplier as big accounts — we need to add a Log(N) factor that accounts for miners with a long mining history, to counterbalance the bias in favor of Pioneers with small balances and provide enough incentive for long-history Pioneers with bigger balances. However, the effect of mining history on lockup rewards also needs to be capped. Thus, the formula applies a logarithm to the number of previous mining sessions N. For example, if a Pioneer mined almost everyday for the last 3 years, their total previous mining sessions (N) will be about 1,000. In this scenario, Log(1,000) equals 3, adding another multiplier to B in their lockup rewards. Keep in mind that to achieve meaningful lockup rewards for long-mining-history Pioneers, the amount of Pi they have to lock up is much more than smaller accounts. <\/span><span style=\"font-weight: 400;\">Fourthly, one Pioneer can voluntarily have multiple lockups at different times with different amounts and durations. The calculation of the total lockup rewards for this Pioneer with<\/span><i><span style=\"font-weight: 400;\"> i<\/span><\/i><span style=\"font-weight: 400;\"> number of different lockups is to find the total lockcup reward multiplier of B, as expressed in the formula below. The formula below is the equivalent to the lockup reward formula above, with the only difference being that it accounts for multiple lockups of the same Pioneer to calculate their total lockup rewards, e.g. different durations (<\/span><span style=\"font-weight: 400;\">Lt<\/span><span style=\"font-weight: 400;\">i<\/span><span style=\"font-weight: 400;\">) and different amounts (<\/span><span style=\"font-weight: 400;\">Lc<\/span><span style=\"font-weight: 400;\">i<\/span><span style=\"font-weight: 400;\">) of each lockup at different time:<\/span> scl-shortcode-cleaner-clean-content-end--><!--scl-shortcode-cleaner-clean-content-start <span style=\"font-weight: 400;\">The purpose of this formula is to calculate the total lockup rewards based proportionally on each lockup’s amount (Lc) over the total Mainnet Balance from previous mining (Lb) as a weight, multiplied by their respective lockup time period (Lt) and Log(N). So that, even though there are multiple lockups of the same Pioneer, more lockups with different settings will proportionally add to their total lockup rewards. The values of Lt, Lc, and log(N) are calculated and multiplied for each lockup <\/span><i><span style=\"font-weight: 400;\">i<\/span><\/i><span style=\"font-weight: 400;\"> and then summed across various <\/span><i><span style=\"font-weight: 400;\">i<\/span><\/i><span style=\"font-weight: 400;\">’s, which is then divided by the value of Lb at a given mining session, to arrive at the value of L(B) for that mining session. This formula ensures that regardless of the Lb, as long as the Pioneer maintains the same percentage of their lockup amount over their Lb, the total lockup rewards multiplier will remain the same. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Lastly, when can a Pioneer lock up Pi? Pioneers can decide their lockup duration and lockup percentage of their transferable balance anytime they want as an overall account setting in the Pi app. They can even preselect these settings before they’re KYC’ed or ready to migrate to the Mainnet. As they and their Referral Team\/Security Circle pass KYC, more of their Mobile Balance will become transferable. At the moment of the migration of their Transferable Balance to Mainnet, their preselected setting of lockup duration and percentage will automatically apply to the amount of balance transferred, resulting in two types of balances on the Mainnet: lockup balance and free balance, both of which will be recorded on the Mainnet blockchain and reside in the Pioneer’s non-custodial Pi wallet. Thus, lockups cannot be reversed once confirmed and must remain locked up for the entirety of the chosen duration due to the nature of blockchain. Any changes to this Pioneer&#8217;s lockup setting will take effect in their next balance transfer to the Mainnet. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This account-wide lockup setting allows Pioneers to lock up a maximum of 100% of their transferable balance from mobile to Mainnet. After Mainnet launches and Pioneers transfer their balances, Pioneers can also lock up more Pi directly on the Mainnet through a slightly different lockup interface later on. At that time, Pioneers can lock up as much as 200% of their already-transferred Mainnet balance acquired from their previous mining. The additional lockup allowance for more Pi than individually mined by the Pioneer can come from utility-based Pi apps transactions, i.e., making Pi from selling goods and services.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">App Usage Reward<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">An overarching goal of Pi Network is to build an inclusive peer-to-peer ecosystem and online experience fueled by the Pi cryptocurrency through our app ecosystem. Therefore, Pioneers will have additional mining rewards for using Pi apps on the Pi apps platform through the Pi Browser, including ecosystem apps and third-party apps in the Pi Directory. The app usage reward for Pioneers helps the ecosystem in two ways. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">First, it will give Pi app developers market access and increased impressions of their apps. Pi app developers will gain usage and product iteration opportunities from Pioneers, which has been one of the biggest barriers to creating viable decentralized applications in the blockchain industry. Decentralized application (dApp) developers do not yet have a plentiful, stable, and utility-seeking consumer market environment to test and hone their consumer products to create consumer utilities. Pi Network’s apps platform and the app usage reward are meant to provide that environment for dApp developers.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Second, the increased impressions and usage will potentially lead to increased spending of Pi by Pioneers in the Pi apps. Even though the impressions are incentivized through the app usage reward, the spending of Pi is not. This means that the Pi app usage reward to Pioneers helps the Pi app developers to the extent that Pioneers are at their door. Now what determines whether Pioneers will actually stay and spend Pi in their apps is how useful and engaging their products and apps are. This framework ensures that these apps are able to compete on the basis of product quality and utility, ultimately allowing the best apps to emerge and stay in the ecosystem. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Through the above two mechanisms, the app usage reward aims to achieve the gradual transition from extrinsic incentives to intrinsic motivations among Pioneers visiting Pi apps, and thus the transition from incentivized to organic usage of Pi apps in order to ultimately bootstrap a utility-based ecosystem of apps using Pi.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The app usage reward formula is reprinted here:<\/span><\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"alignnone wp-image-994 size-full\" src=\"https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6.jpg\" alt=\"\" width=\"813\" height=\"326\" srcset=\"https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6.jpg 813w, https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6-300x120.jpg 300w, https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6-768x308.jpg 768w, https:\/\/minepi.com\/wp-content\/uploads\/2023\/04\/Untitled-design-6-18x7.jpg 18w\" sizes=\"(max-width: 813px) 100vw, 813px\" \/><\/p>\n<ul>\n<li><b>time_spent_per_app_yesterday_in_seconds<\/b><span style=\"font-weight: 400;\"> is, for each Pi app, the total amount of time in seconds that the Pioneer spends using the app on the prior day.<\/span><\/li>\n<li><b>Σ_across_apps<\/b><span style=\"font-weight: 400;\"> sums up the logarithmic value of the Pioneer’s time_spent_per_app_yesterday_in_seconds across all the Pi apps. <\/span><\/li>\n<li><b>avg_daily_time_spent_across_apps_last_*_days\/years<\/b><span style=\"font-weight: 400;\"> is the average daily time in seconds the Pioneer spends across all the Pi apps in the aggregate during the last * time period. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">* Note that when any of the logarithmic functions returns an undefined value or a value below 0 (that is, when, the input to the logarithmic function is below 1), the formula resets the value of the logarithmic function to be 0 in order to avoid negative mining rewards or an error in the function. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Generally, the app usage reward formula takes into account two factors: time spent in apps and the number of apps used while crediting the history of app usage in the long term and capping the rewards to avoid exploitation. There are two main parts to the formula. The first part aggregates a Pioneer’s time spent across each app in the last mining session (i.e., in the previous day). The logarithmic function provides a positive function with diminishing rewards, meaning that an increase in time spent on any one app will generally increase the rewards, but the positive effect of time spent on rewards decreases as more time is spent. This setup encourages Pioneers to generally spend more time on multiple diverse apps, helping the network to bootstrap the creation of diverse utilities. At the same time, it caps the rewards to prevent users from exploiting this reward by artificially keeping the apps open all day, which would not meaningfully contribute to utilities creation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The second part of the app usage reward formula looks at a Pioneer’s rolling average of daily time spent across all apps in various time periods. The further back the time period goes, the less it is weighted. In other words, a Pioneer mines more Pi the longer they have been using the Pi apps, but their recent time spent on the apps counts more toward mining than their previous time spent further back in the past. In addition, as a matter of fact, the app usage history takes effect on the current mining reward only if the Pioneer also used Pi apps during their last mining session. This means that there is no passive reward for only the past usage. Once again, the use of logarithmic functions helps moderate the mining boost from app usage to avoid exploitation of the app usage reward. A noteworthy implication here is that Pi chat moderators who have been helping to guide Pioneers and monitor undesirable activities on Pi chats over the last two years will mine the app usage reward at a higher rate when the Mainnet launches.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Node Reward<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Like on any blockchain, Nodes are at the heart of the decentralization of Pi. <\/span><span style=\"font-weight: 400;\">In Pi, instead of relying on centralized institutional nodes, we decided to open up the Nodes to any Pioneer with a computer connected to the internet. <\/span><span style=\"font-weight: 400;\">Aided by the global trust graph aggregated from individual Pioneer’s Security Circles from the mobile app, these Nodes will run the consensus algorithm to validate transactions and process blocks. Because the Nodes are critical to the decentralization, security, and longevity of the Pi blockchain, Node-operating Pioneers will receive additional mining rewards. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The node reward formula is reprinted here:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">N(I) = node_factor • tuning_factor • I, where<\/span><\/p>\n<ul>\n<li><b>Node_factor<\/b><span style=\"font-weight: 400;\"> = Percent_uptime_last_1_days • (Uptime_factor + Port_open_factor + CPU_factor), where<\/span>\n<ul>\n<li><b>Uptime_factor<\/b><span style=\"font-weight: 400;\"> = (Percent_uptime_last_90_days + 1.5*Percent_uptime_last_360_days(360-90) + 2* Percent_uptime_last_2_years + 3*Percent_uptime_last_10_years),<\/span><\/li>\n<li><b>Port_open_factor<\/b><span style=\"font-weight: 400;\"> = 1 + percent_ports_open_last_90_days + 1.5*percent_ports_open_last_360_days + 2* percent_ports_open_last_2_years + 3*percent_ports_open_last_10_years,<\/span><\/li>\n<li><b>CPU_factor<\/b><span style=\"font-weight: 400;\"> = (1 + avg_CPU_count_last_90_days + 1.5*avg_CPU_count_last_360_days + 2* avg_CPU_count_last_2_years + 3*avg_CPU_count_last_10_years)\/4. <\/span><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">        <\/span> <span style=\"font-weight: 400;\">        <\/span> and<\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li><b>Percent_uptime_last_*_days\/years<\/b><span style=\"font-weight: 400;\"> is the percentage of the last * time period when the individual Node was live and accessible by the network. <\/span><\/li>\n<li><b>percent_ports_open_last_*_days\/years<\/b><span style=\"font-weight: 400;\"> is the percentage of the last * time period when the ports of the individual Node were open for connectivity to the network.<\/span><\/li>\n<li><b>avg_CPU_count_last_*_days\/years<\/b><span style=\"font-weight: 400;\"> is the average CPU that the individual Node provided to the network during the last * time period. <\/span><\/li>\n<li><b>tuning_factor<\/b><span style=\"font-weight: 400;\"> is a statistical factor that normalizes the node_factor to a number between 0 and 10. <\/span><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The node reward depends on the uptime factor, port open factor, CPU factor, and the tuning factor. The uptime factor of a Node for a given period of time is the proportion of time the Node is active during that period. For example, a 25% uptime factor yesterday means that the Node was live and accessible for a total of 6 out of 24 hours yesterday. The Pi Node software tracks the time a particular Node is active. Starting in the Open Network phase, only a Node running functionally at a given point in time is considered active. This is a proxy for the reliability of the Node. However, for the historical data relevant to the mining reward, a Node is considered active if the Node app is open and connected to the internet even if it is not running functionally. This exemption for the past performance recognizes that the Community Node operators running the Testnet provided the network with important data and infrastructure to enable multiple iterations of the Node software and Testnet, and that it was not always the fault of the Node operator that their Nodes were inoperative. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The port open factor of a Node for a given period of time is the proportion of time the Node’s specific ports are detected to be accessible from the Internet during that period. Pi Nodes use ports 31400 through 31409, enabling other nodes to reach them through these ports and the network IP address. An open-port Node is able to respond to communications initiated by other Nodes, while closed-port Nodes are not able to receive such communications from other Nodes and can only initiate communications. Pi’s consensus protocol relies on Nodes sending a series of messages among each other. Therefore, open-port Nodes are critical to the operation of the Pi blockchain, and thus, worthy of a mining reward boost. In fact, the network aims to have at least 1\/8<\/span><span style=\"font-weight: 400;\">th<\/span><span style=\"font-weight: 400;\"> of the Nodes with open ports, and having an open port is one of the prerequisites for being a Super Node. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The CPU factor of a Node for a given period of time is the average number of CPU cores\/threads available on the computer during that period. A higher CPU factor prepares the blockchain for future scalability, for example, the ability to process more transactions per block or more transactions per second. The Pi blockchain is not an energy and resource-intensive blockchain. The network is initially set to operate at one new block of up to 1,000 transactions (T) about every 5 seconds. Thus the network is effectively capable of processing up to about 200 transactions per second (TPS) or ~17M T\/day. Should the blockchain get congested in the future, this limit can be increased to 2,000 TPS (~170M T\/day) by increasing the block size from 1000 to 10,000 transactions per block. The higher the CPU contributed by Pi Nodes, the more room the network will have to grow and scale further in the future. Furthermore, higher collective CPU from Pi Nodes will allow novel peer-to-peer node-based applications to be built on Pi Network, such as decentralized CPU sharing applications that let computing power-intensive applications run or provide distributed cloud services. Such services will be further rewarding contributing nodes with additional Pi paid by the clients of those services.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Finally, a tuning factor normalizes the Node reward to a number between 0 and 10. This is meant to make Node rewards comparable to other types of mining rewards that recognize other contributions to Pi Network. During the Enclosed Mainnet phase (as explained in the Roadmap section), the Node reward formula is expected to iterate. For example, the use of logarithmic or root functions may potentially obviate the need for a tuning factor. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Having reliable Nodes running predictably over a long stretch of time is critical to the health of the blockchain. It is not a one and done contribution. Therefore, the uptime factor, port open factor, and the CPU factor are all calculated over varying time periods, where the value from more recent time periods are more heavily weighted than the time periods of equal lengths from a more distant past. Note, however, that the Node reward is a multiple of the uptime factor of the previous mining session. Hence, a Pioneer will not receive any Node reward in a given mining session if their Node was inactive for the entirety of the immediately preceding calendar day. Similar to the app usage reward, there is no passive reward for only the past contribution as a Node operator. This also means that a low uptime factor in the previous calendar day (even if the Node is active for a part of the day) will substantially reduce the Node reward in a given day despite high past Node contributions. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">The Effect of KYC on Mainnet rewards<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">There will be a rolling grace period of six calendar months for a Pioneer to complete KYC. Thereafter, the Pi mined outside of the rolling 6-month window will not be transferable to the Mainnet, and will instead be reallocated to Pioneer mining rewards, as discussed below. The retention of the mined Pi in the 6-month window continues indefinitely until they pass KYC or the KYC policy changes. Note that this KYC-window mining framework will only begin when the KYC solution is generally available to all eligible Pioneers in the future, and will be announced to the community beforehand. The six-month restriction will not be immediately in place yet when we launch the Mainnet. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Because of the importance of true humanness in our social network-based mining, only the Pioneers who pass KYC will be able to transfer their Phone balance to the blockchain. Our objective is to have as many true Pioneers as possible pass KYC. As explained further below, the rolling six-month window serves the following important purposes: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">strike a balance between giving Pioneers adequate time to pass KYC and creating enough urgency to pass KYC,<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">prevent unverified Pi beyond the rolling six-month KYC grace period from migrating to the Mainnet, instead freeing it up for mining by other KYC’ed Pioneers within the allocated Pi overall supply limit for Pioneer mining, and<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">limit KYC spam and abuse (see 30-day delay in KYCing new members below)<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">If Pioneers do not pass KYC in time, it delays the Mainnet transfer of their balances and the balances of other Pioneers who have them on their Security Circles and Referral Teams. Without balances on the Mainnet, Pioneers are not able to use payments in Pi apps, thereby undermining the growth of our utility-based ecosystem. A six-month window creates a sense of urgency for Pioneers while giving them adequate time to retrieve their mined Pi. The KYC verification process will generally take into account Pioneers’ likelihood of being real human beings based on Pi’s machine-automated prediction mechanisms run over the last three years. Newly created accounts will not be able to immediately apply for KYC verification, until after 30 days. This helps the network limit the ability of bots and fake accounts to spam and abuse our KYC process and prioritize KYC validation resources for real human Pioneers. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Finally, the Pi of the Pioneers who delay KYC verification beyond six months will not be transferred to the Mainnet and will not be accounted for in the calculation of the systemwide base mining rate (B) beyond the rolling six-month KYC grace period. Pioneers will, therefore, need to claim their Pi in time, or their Pi will be reallocated to B for mining in the same year by other verified Pioneers who can make full contributions to the network. <\/span> scl-shortcode-cleaner-clean-content-end--><span style=\"font-weight: 400;\">Pi Network is unique in our technological and ecosystem design as well as the significance of our community input in development. This uniqueness is best served by a thoughtful and iterative approach that allows for community feedback, testing of products, features, and user experience, and phases defined by milestones. There are three main phases to our development: (1) Beta, (2) Testnet, and (3) Mainnet. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Phase 1: Beta<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In December 2018, we publicly launched our mobile app on the iOS App store as an alpha prototype that onboarded the initial Pioneers. On Pi Day, March 14, 2019, the original Pi whitepaper was published, marking the official launch of the Pi Network. At this stage, our app allowed Pioneers to mine Pi by contributing to the growth and security of the future Pi blockchain. As the eventual goal was to launch the Mainnet and build an ecosystem around the Pi platform, the Pi app running on the centralized Pi server enabled mobile phone users (Pioneers) to contribute their Security Circles that, in aggregate, built the trust graph required by the consensus algorithm of the Pi Blockchain, and in return, the Pioneers received mining rewards. Furthermore, the centralized phase allowed the network to grow, the community to form, and the Pi token to be accessible and widely distributed. This phase also allowed for the iteration of many technical features and Pioneer experience by leveraging community input throughout the development process.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The following major accomplishments were made during the Beta phase: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The Pi Network mobile app was listed and accessible through the iOS App Store and Google Playstore.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Pi Network grew from 0 to over 3.5 million engaged Pioneers. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The Pi Network community actively engaged with the project through the app home screen interactions and chat app.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Pi Network reached 233 countries and regions around the world.<\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">Phase 2: Testnet<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">This phase started on March 14, 2020, marking another critical preparation to the transition to a decentralized blockchain—a live Testnet with distributed Nodes from all over the world. Pi Network’s Node software enabled individual computers to support running the Pi Testnet using Test-Pi coin. Test-Pi was available only for the purpose of testing and has no relation to Pioneers’ account balances on the Pi app. The Pi Testnet has reached over 10,000 fully functional community Nodes and over 100,000 daily active Nodes on the waiting list, and as explained in a later section, will continue to exist for testing purposes in the Mainnet phase.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Pi Testnet allows for the testing of connectivity, performance, security, and scalability of the blockchain, and allows Pi apps developers to develop the Pi apps before they can deploy their app on the Mainnet. During the Testnet phase, 3 major strategies were adopted: (1) decentralization through Testnet Nodes, (2) growth through the main Pi app for mobile mining, and (3) utility creation through the Pi apps platform on the Pi Browser. The Testnet ran in parallel with the Pi mobile mining app from Phase 1 and enabled decentralized community Nodes to get online and ready for the Mainnet. Specifically, the Testnet Nodes helped with the assessment of the blockchain’s performance, security, and scalability. It also helped Pi App developers test their apps against the Pi Blockchain. At the same time, the Pi mobile mining app continued to onboard millions of Pioneers, building the community and contributing to the security of the blockchain. The Pi Browser, along with the Pi SDK, enabled the community to create utilities and develop the Pi ecosystem. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The following major accomplishments were made during the Testnet phase: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Many versions of the Node software were released.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The Pi Platform was released along with key ingredients of our ecosystem infrastructure: Wallet, Browser, Brainstorm and developer tools.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Pilot version of the KYC app was introduced on the Pi Browser.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The project ran its first ever worldwide online Hackathon with thousands of participants from within the Pioneer Community. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Pi Network grew to over 30 million engaged Pioneers, and from 0 to over 10,000 fully functional community Nodes and over 100,000 daily active Nodes on the waiting list. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Pi Network reached almost all countries and regions in the world. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">Phase 3: Mainnet<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In December 2021, the Mainnet of the Pi blockchain will go live. The migration of Pioneer balances from their phone account to the Mainnet starts during this period. KYC authentication of a Pioneer precedes their balance migration to the Mainnet. In order to allow for sufficient time for millions of Pioneers to successfully complete their KYC verification, create utilities in the Pi ecosystem, and continue to iterate on our technology and ecosystem design, the Mainnet will have two periods: <\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">at first, firewalled Mainnet (i.e., the Enclosed Network), <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">and then, open Mainnet (i.e., the Open Network). <\/span><\/li>\n<\/ol>\n<h3><span style=\"font-weight: 400;\">The Enclosed Network Period<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This period will begin in December 2021. The Enclosed Network period means that the Mainnet is live but with a firewall that prevents any unwanted external connectivity. Pioneers will be able to take time to KYC and migrate their Pi to the live Mainnet blockchain. Any balance migrated to the Mainnet can be used, by the choice of the Pioneer, to purchase goods and services in Pi apps, transfer to other Pioneers, or get locked up for a duration of time for a higher mining rate. KYC’ed Pioneers will be able to use their Pi on the Mainnet freely in an enclosed environment within Pi Network. However, this period will not allow connectivity between the Pi blockchain and other blockchains. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Advantages of the Two-Period Approach to Mainnet<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">There are multiple advantages to having an <\/span><b>intermediate<\/b><span style=\"font-weight: 400;\"> enclosed period to ramp up to the fully open Mainnet. This approach allows time for: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">millions of Pioneers worldwide to pass KYC, <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">building and deploying more Pi Apps and allowing more utilities to be created and used, <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">transitioning Pi Apps deployed on the Testnet to the Mainnet, and<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">iterating on any modifications and adjustments to the Mainnet and the ecosystem before the Open Network. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The Enclosed Network period allows time for millions of Pioneers to KYC and migrate their Pi to the Mainnet. Only a small fraction of Pioneers have been able to complete their KYC around the launch of the Mainnet. Over the coming months, we will continue to roll out the KYC solution to more Pioneers and help them complete their KYC. If we moved directly from Testnet to Open Network, this would mean that the Pioneers who were able to KYC before others would have Pi available for use outside of the Pi platform while the Pioneers still waiting to complete their KYC would not yet have this privilege. The speed at which Pioneers all over the world are able to complete their KYC will depend on the speed at which each local community provides the KYC validator crowd work force as well as the speed at which individual Pioneers participate in the KYC. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Having the Enclosed Network period gives time for millions of Pioneers to complete their KYC and transfer their Pi to the Mainnet. This way, all the Pioneers who are willing and able to complete their KYC in a reasonable period of time get to use their Pi outside of the Pi platform at once. Given that external connectivity between the Pi Blockchain and other blockchains or systems is not allowed during the Enclosed Network period, this further helps Pioneers focus on transitioning into Mainnet without any influences external to the Pi Blockchain. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This period will also help the community focus on creating utilities and bootstrapping the ecosystem without any external distractions. Consistent with the vision of the Pi network to enable a utility-based ecosystem, this allows apps to deploy on Mainnet and create utilities for Pioneers. Pi apps will be able to switch from Testnet to Mainnet—to production mode for real Pi transactions. At this time, KYC’ed Pioneers will be able to spend their Pi on Pi apps, boosting utilities creation and bootstrapping the Pi ecosystem before the Open Network. This gradual and deliberate ramp to Open Network will help the apps, as well as the Pi Network, to uncover and resolve any glitches in the market and the technology. Thus, the Enclosed Network period is in line with Pi’s vision of a utility-based ecosystem and its iterative philosophy.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Moreover, the Enclosed Network will allow the Mainnet to run with production data and real Pi, which differs from Testnet. Data gathered during the Enclosed Network will help calibrate and tweak any configurations and formulae, if necessary, to ensure a stable and successful Open Network. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">KYC Verification and Mainnet Balance Transfer<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">“Know Your Customer\/Client” (KYC) is a process that verifies identification to distinguish genuine accounts from fake ones. The vision of Pi Network is to build an inclusive and the most widely distributed token and ecosystem for all Pioneers. The mining mechanism of Pi Network is social network-based, and the mining rate has halved 5 times so far as the social network size grew to over 1K, 10K, 100K, 1M, and 10M engaged members. Therefore, Pi has a strict policy of one account per person. This requires a high degree of accuracy to establish that members in the network are genuine human beings, preventing individuals from being able to unfairly hoard Pi by creating fake accounts. Pioneers’ KYC results will depend on not only identity verification, but also their name matching with the Pi account and screening against government sanction list. KYC, thus, helps ensure the true humanness of the network and compliance with the Anti-Money Laundering (AML) and anti-terrorism regulations. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As communicated at the founding of the network, to ensure true humanness, fake Pi accounts and scripted mining are strictly prohibited. These accounts will be disabled, and will not be able to migrate to Mainnet. Over the past three years, multiple technical mechanisms have been implemented to identify bots and fake accounts. For the accounts identified as highly likely to be fake by Pi’s algorithm, the weight is on these accounts to prove otherwise. These identified fake accounts will either be disabled or go through a much more rigorous review and appeal process. The allocation of KYC slots will be prioritized for accounts with a high likelihood of being true human holders. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Only the accounts with verified identities will be allowed to transition to Mainnet, and only the Pi balances attributable to identity-verified accounts will be allowed to transfer to the Mainnet balance. When a Pioneer and their Referral Team and Security Circle members pass the KYC determines if and when, and to what extent, a Pioneer can transfer their balances. Below is a hypothetical example to illustrate how the KYC verification of Pioneers affects their balances in migration to the Mainnet. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For simplicity, we define different concepts of Pi balances as follows:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b><i>Mobile Balance<\/i><\/b><b>: <\/b><span style=\"font-weight: 400;\">The Pi balance currently shown in a Pioneer’s account in the Pi mobile app<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b><i>Transferable Balance<\/i><\/b><b>: <\/b><span style=\"font-weight: 400;\">The balance that has been allowed to be transferred to the Mainnet because the Pioneer and their specific associated individuals in the Referral Teams and Security Circles have passed KYC<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b><i>Mainnet balance<\/i><\/b><b>: <\/b><span style=\"font-weight: 400;\">The balance that has been migrated and transferred by the Pioneer to the Mainnet<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Suppose individual <\/span><b>A<\/b><span style=\"font-weight: 400;\"> is the owner of a Pi account who wants to transfer their Mobile Balance. Pioneer A will only be allowed to transfer any of the Mobile Balance to the Mainnet when their identity is verified, i.e., when they pass the KYC. Let’s say this individual has Individuals <\/span><b>B<\/b><span style=\"font-weight: 400;\">, C, <\/span><b>D<\/b><span style=\"font-weight: 400;\">, and E on their Referral Team and Individuals <\/span><b>D<\/b><span style=\"font-weight: 400;\">, E, <\/span><b>F<\/b><span style=\"font-weight: 400;\">, and G in their Security Circle. So far, only individuals <\/span><b>A<\/b><span style=\"font-weight: 400;\">, <\/span><b>B<\/b><span style=\"font-weight: 400;\">, <\/span><b>D<\/b><span style=\"font-weight: 400;\">, and <\/span><b>F<\/b><span style=\"font-weight: 400;\"> have completed their KYC verification. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In this example setup: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>A<\/b><span style=\"font-weight: 400;\"> is a mining Pioneer who has passed KYC.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>B<\/b><span style=\"font-weight: 400;\">, C, <\/span><b>D, <\/b><span style=\"font-weight: 400;\">E<\/span> <span style=\"font-weight: 400;\">are in the Referral Team of A.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>D<\/b><span style=\"font-weight: 400;\">, E, <\/span><b>F<\/b><span style=\"font-weight: 400;\">, G are in the Security Circle of A.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>A<\/b><span style=\"font-weight: 400;\">,<\/span><b> B<\/b><span style=\"font-weight: 400;\">,<\/span><b> D<\/b><span style=\"font-weight: 400;\">, and<\/span><b> F<\/b><span style=\"font-weight: 400;\"> have passed KYC.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Here, A’s Transferable Balance is the sum of the following three components:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Pioneer Rewards<\/b><span style=\"font-weight: 400;\">: Pi mined based on A’s Pioneer status across all mining sessions<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Contributor Rewards<\/b><span style=\"font-weight: 400;\">: D and F’s contribution to A&#8217;s mining rate as Contributors in all mining sessions<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Ambassador Rewards<\/b><span style=\"font-weight: 400;\">: Mining bonuses from all mining sessions when B and D as Referral Team members mined during the same session as A mined<\/span><\/li>\n<\/ul>\n<p><b>As more of Pioneer A’s Referral Team and Security Circle members (i.e., C, E, and G) pass KYC, more portions of A’s Mobile Balance will become Transferable Balance—ready for A to migrate to the Mainnet, and ultimately become A’s Mainnet Balance. <\/b><\/p>\n<p><span style=\"font-weight: 400;\">During the Enclosed Mainnet period, any Mobile Balance that has not become Transferable Balance will remain in the Mobile mining app until the associated Pioneers in the Referral Team and Security Circles pass KYC and the corresponding amount becomes transferable to Mainnet. In the case of the above example of Pioneer A, the balance contribution by C, E, and G will remain as Mobile Balance for A in the mining app waiting for them to pass KYC in order for such balance to become transferable. <\/span><span style=\"font-weight: 400;\">If such associated accounts never pass KYC, the balance attributed to these non-KYC’ed accounts will expire at a certain date which will have allowed enough time for the whole network to KYC. The unclaimed balances due to lack of KYC will be discarded by not being transferred to the Mainnet at all, instead freeing it up for mining by other KYC’ed Pioneers within the allocated Pi overall supply limit for Pioneer mining as explained in the Pi Supply section. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Restrictions in the Enclosed Network<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">While transactions between Pi apps and Pioneers and Pioneer-to-Pioneer transactions are allowed within Pi Network, the Enclosed Network will have in place the restrictions as listed below. These restrictions at this stage help enforce the enclosed nature of the network: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">There will be no connectivity between Pi and other blockchains or crypto exchanges.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Mainnet can only be accessed through the Pi Wallet and Pi apps on the Pi Browser.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The Mainnet blockchain will be accessible to any computer on the internet but only through a firewall to enforce the above rules.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">There will only be Core Team Nodes on the Mainnet to ensure that the firewall is in place at all times.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The Enclosed Network will support the economic activities and growth of the Pi ecosystem. Thus, Pioneer-to-Pioneer transactions are possible through the Pi Wallet as KYC’ed Pioneers will be able to use the Pi Wallet to transact in Pi. Pioneers can also spend Pi in Pi apps on the Pi Browser, which can access the Mainnet through the Pi Apps SDK and the Pi Blockchain API. During the Enclosed Network period, an app on the Pi Browser can only use the Pi blockchain APIs whitelisted by the firewall to interact with the Mainnet.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The following uses of Pioneer-to-Pioneer, Pioneer-to-App, and App-to-Pioneer transactions will be allowed: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Exchange of Pi for goods and services through Pi Apps<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Transfer of Pi between Pioneers for goods and services<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The following uses will be prohibited: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Exchange of Pi for fiat currency<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Exchange of Pi for other cryptocurrencies<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Transfer for Pi for a future promise of fiat or other cryptocurrencies<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">We will enforce the above restrictions by adding a firewall to the Mainnet and by exclusively running the Mainnet Nodes for this <\/span><b>interim<\/b> <b>period<\/b><span style=\"font-weight: 400;\">. Community Nodes will continue to run on the Testnet in the Enclosed Network period. We will continue to implement interface and other changes to the Nodes in preparation for the Open Network period where the Community Nodes will be able to run on the Mainnet. The restrictions of the Network to keep it enclosed will be relaxed as it reaches the next period—Open Network.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Open Network Period<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Depending on the maturity of the Enclosed Network ecosystem and the progress of the KYC, this period may begin on Pi Day (March 14, 2022), Pi2 Day (June 28, 2022), or later. The Open Network period means that the firewall in the Enclosed Network period will be removed, allowing any external connectivity, e.g., to other networks, wallets, and anyone who wants to connect to Pi Mainnet. API calls will not be firewalled, and Pioneers will be able to run their own Pi Nodes and API services. Pioneers will have connectivity with other blockchains. Community Nodes can also run the Mainnet. <\/span> scl-shortcode-cleaner-clean-content-end-->\n","protected":false},"excerpt":{"rendered":"<p>The December 2021 Whitepaper chapters &#8220;Token Model and Mining&#8221; and &#8220;Roadmap&#8221; were released as an addendum to the original 2019 Whitepaper, with new information on Mainnet. The original March 2019&#8230;<\/p>\n","protected":false},"author":4,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.13 (Yoast SEO v20.13) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Pi Cryptocurrency White Paper | Pi Network<\/title>\n<meta name=\"description\" content=\"Read the Whitepaper to learn how Pi Network is building a cryptocurrency and smart contracts platform secured and operated by everyday people.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/minepi.com\/white-paper\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Pi Whitepaper\" \/>\n<meta property=\"og:description\" content=\"Read the Whitepaper to learn how Pi Network is building a cryptocurrency and smart contracts platform secured and operated by everyday people.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/minepi.com\/white-paper\/\" \/>\n<meta property=\"og:site_name\" content=\"Pi Network\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/PiCoreTeam\/\" \/>\n<meta property=\"article:modified_time\" content=\"2023-07-17T17:35:32+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/minepi.com\/wp-content\/uploads\/2022\/07\/1fMI7MFSKc-LYicXLVgZIUTajNALLAyqNTflmeAT4EU.webp\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/webp\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@PiCoreTeam\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"91 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/minepi.com\/white-paper\/\",\"url\":\"https:\/\/minepi.com\/white-paper\/\",\"name\":\"Pi Cryptocurrency White Paper | Pi Network\",\"isPartOf\":{\"@id\":\"https:\/\/minepi.com\/#website\"},\"datePublished\":\"2022-06-22T15:12:04+00:00\",\"dateModified\":\"2023-07-17T17:35:32+00:00\",\"description\":\"Read the Whitepaper to learn how Pi Network is building a cryptocurrency and smart contracts platform secured and operated by everyday people.\",\"breadcrumb\":{\"@id\":\"https:\/\/minepi.com\/white-paper\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/minepi.com\/white-paper\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/minepi.com\/white-paper\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/minepi.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Pi Whitepaper\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/minepi.com\/#website\",\"url\":\"https:\/\/minepi.com\/\",\"name\":\"Pi Network\",\"description\":\"The First Digital Currency You Can Mine On Your Phone\",\"publisher\":{\"@id\":\"https:\/\/minepi.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/minepi.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/minepi.com\/#organization\",\"name\":\"Pi Network\",\"url\":\"https:\/\/minepi.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/minepi.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/pinetwork.wpengine.com\/wp-content\/uploads\/2022\/06\/Pi-Network.png\",\"contentUrl\":\"https:\/\/pinetwork.wpengine.com\/wp-content\/uploads\/2022\/06\/Pi-Network.png\",\"width\":1000,\"height\":232,\"caption\":\"Pi Network\"},\"image\":{\"@id\":\"https:\/\/minepi.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/PiCoreTeam\/\",\"https:\/\/twitter.com\/PiCoreTeam\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Pi Cryptocurrency White Paper | Pi Network","description":"Read the Whitepaper to learn how Pi Network is building a cryptocurrency and smart contracts platform secured and operated by everyday people.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/minepi.com\/white-paper\/","og_locale":"en_US","og_type":"article","og_title":"Pi Whitepaper","og_description":"Read the Whitepaper to learn how Pi Network is building a cryptocurrency and smart contracts platform secured and operated by everyday people.","og_url":"https:\/\/minepi.com\/white-paper\/","og_site_name":"Pi Network","article_publisher":"https:\/\/www.facebook.com\/PiCoreTeam\/","article_modified_time":"2023-07-17T17:35:32+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/minepi.com\/wp-content\/uploads\/2022\/07\/1fMI7MFSKc-LYicXLVgZIUTajNALLAyqNTflmeAT4EU.webp","type":"image\/webp"}],"twitter_card":"summary_large_image","twitter_site":"@PiCoreTeam","twitter_misc":{"Est. reading time":"91 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/minepi.com\/white-paper\/","url":"https:\/\/minepi.com\/white-paper\/","name":"Pi Cryptocurrency White Paper | Pi Network","isPartOf":{"@id":"https:\/\/minepi.com\/#website"},"datePublished":"2022-06-22T15:12:04+00:00","dateModified":"2023-07-17T17:35:32+00:00","description":"Read the Whitepaper to learn how Pi Network is building a cryptocurrency and smart contracts platform secured and operated by everyday people.","breadcrumb":{"@id":"https:\/\/minepi.com\/white-paper\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/minepi.com\/white-paper\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/minepi.com\/white-paper\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/minepi.com\/"},{"@type":"ListItem","position":2,"name":"Pi Whitepaper"}]},{"@type":"WebSite","@id":"https:\/\/minepi.com\/#website","url":"https:\/\/minepi.com\/","name":"Pi Network","description":"The First Digital Currency You Can Mine On Your Phone","publisher":{"@id":"https:\/\/minepi.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/minepi.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/minepi.com\/#organization","name":"Pi Network","url":"https:\/\/minepi.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/minepi.com\/#\/schema\/logo\/image\/","url":"https:\/\/pinetwork.wpengine.com\/wp-content\/uploads\/2022\/06\/Pi-Network.png","contentUrl":"https:\/\/pinetwork.wpengine.com\/wp-content\/uploads\/2022\/06\/Pi-Network.png","width":1000,"height":232,"caption":"Pi Network"},"image":{"@id":"https:\/\/minepi.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/PiCoreTeam\/","https:\/\/twitter.com\/PiCoreTeam"]}]}},"featured_image_src":null,"featured_image_src_square":null,"_links":{"self":[{"href":"https:\/\/minepi.com\/wp-json\/wp\/v2\/pages\/123"}],"collection":[{"href":"https:\/\/minepi.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/minepi.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/minepi.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/minepi.com\/wp-json\/wp\/v2\/comments?post=123"}],"version-history":[{"count":0,"href":"https:\/\/minepi.com\/wp-json\/wp\/v2\/pages\/123\/revisions"}],"wp:attachment":[{"href":"https:\/\/minepi.com\/wp-json\/wp\/v2\/media?parent=123"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}